{"text": [
		{"SYSTEM": "In a distant land... The peace enjoyed by the people came to a crashing end. The emperor of Palamecia summoned fiends from another dimension... And the empire launched its campaign for world conquest. In response, a rebel force arose in the kingdom of Fynn. In the ensuing clash between rebel and empire, Castle Fynn was taken. The rebels were forced to retreat to the remote town of Altair. Amidst the chaos, four youths also fled the occupied Fynn. They were childhood friends, now orphaned and homeless... And they suddenly found themselves running for their lives."},
		{"Imperial Soldier": "You've come a long way from Fynn, but you've nowhere left to run!"},
		{"ACTION": "A group of imperial soldiers surrounds the party on both sides."},
		{"Maria": "Firion!"},
		{"Gus": "No escape!"},
		{"Imperial Soldier": "By imperial order, all who defy us shall be put to death."},
		{"Imperial Soldier": "You've brought this upon yourselves. You peasants never learn, do you?"},
		{"ACTION": "Battle with Black Knight x 4. No matter what actions the party takes, defeat is swift and inevitable."},
		{"SYSTEM": "Defeated..."},
		{"ACTION": "Scene change. In a small room, a white mage named Mindu is shown reviving Firion."},
		{"Hilda": "Will he survive, Mindu?"},
		{"Mindu": "Yes, Your Highness, he should regain consciousness in no time. I feel strong energy from him."},
		{"Hilda": "That is good. On the retreat of Fynn, I found him and the other two lying in their own blood..."},
		{"Mindu": "(nods) \"We should leave him for now. This magic sigil will strengthen his life force."},
		{"Hilda": "Thank you, MIndu. That is wonderful."},
		{"Hilda": "Well, let's join the others. They must be waiting for us."},
		{"Hilda": "Once the empire completes the Dreadnought in Bafsk, it may well launch all-out war. We must move quickly!"},
		{"ACTION": "They exit the room and Firion wakes up."},
		{"Firion": "Wh-Where am I?\" ! \"Where is everyone else?"},
		{"Firion": "Leon!"},
		{"Firion": "Maria!"},
		{"Firion": "Gus!"},
		{"ACTION": "He exits the room and quickly finds the others in the adjacent hallway."},
		{"Firion": "!"},
		{"Maria": "! \"Firion! I\"m so glad you're alive! I thought I'd...\" *sob*"},
		{"Firion": "Maria!"},
		{"Firion": "Gus!"},
		{"Firion": "Where is Leon?"},
		{"Gus": "Fynn princess saved us."},
		{"Gus": "But Leon not here."},
		{"Firion": "I see..."},
		{"Firion": "I'm sure he's fine."},
		{"ACTION": "They join together as a group and enter Hilda's council chambers."},
		{"Hilda": "I see you have regained your strength."},
		{"Firion": "Your Highness, please allow us to join the rebel forces!"},
		{"Hilda": "Nonsense. You would only waste your lives in the war."},
		{"Hilda": "You must go home at once."},
		{"Maria": "But, Your Highness, we no longer have homes. And our parents, they're..."},
		{"Hilda": "! \"Oh... I am very sorry for your losses."},
		{"Hilda": "You are welcome to stay in Altair. You need only know our secret code to live here."},
		{"ACTION": "The player gains control of the party at this point and can move them about freely. Firion is in the lead by default."},
		{"Mindu": "I see your destiny. It is intertwined with mine."},
		{"Mindu": "You must go to Fynn. It will lead to your desired path."},
		{"Hilda": "The password is Wild Rose. Don't forget."},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Hilda about Wild Rose"},
					{"Hilda": "The Wild Rose is Fynn's crest, strong and beautiful as she once was.", "_Keyword": "Wild Rose"},
					{"Hilda": "But now... Oh, what will become of Fynn?", "_Keyword": "Wild Rose"},
					{"Hilda": "I hear captives are being gathered in Fynn. Speaking of which, Maria's brother has been reported missing.", "_Keyword": "Wild Rose"},
					{"Hilda": "Perhaps he is being held in Fynn. Monsters prowl the city now, so even approaching it is dangerous.", "_Keyword": "Wild Rose"}]]},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Mindu about Wild Rose"},
					{"Mindu": "So you've been using the password, have you?", "_Keyword": "Wild Rose"},
					{"Mindu": "Continue doing so. It can unseal the lips of many who would not otherwise offer the time of day.", "_Keyword": "Wild Rose"}]]},
		{"LOCATION": "- Altair Strategy Room -"},
		{"Rebel Soldier": "To the east of here is the port town of Paloom. But you can't cross the lake without a canoe."},
		{"Soldiers at Door": "This is where the rebel army's strategies are made."},
		{"Wizard": "You wish to go to Fynn?"},
		{"Wizard": "Oh no, you shouldn't! The place is crawling with the monsters the emperor brought."},
		{"Wizard": "You'd be lucky to make it to the village of Gatrea up north!"},
		{"LOCATION": "- Altair Rebel Headquarters -"},
		{"Rebel Soldier": "This is the rebels' hideout and its headquarters."},
		{"Man": "Prince Gordon of Kas'ion Kingdom is here in Altair. But he seems to have lost all of his confidence."},
		{"Girl": "Princess Hilda fled Fynn when it was sacked by the imperial army, and so she came to Altair."},
		{"Girl": "She has taken command of the rebel army in place of the injured King."},
		{"LOCATION": "- King's Room -"},
		{"Rebel Soldiers": "This is the King's room. Majesty took an injury on the way from Fynn in his escape."},
		{"King": "I was hit in the back by an arrow."},
		{"King": "I have given my daughter, Hilda, the command of the army."},
		{"LOCATION": "- Altair Village -"},
		{"Pavel": "I'm Pavel, the thief of all thieves. I've been making tons by stealing from the empire's vault!"},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Pavel about Wild Rose"},
					{"Pavel": "I don't steal from the Rebels. I'm from Fynn too, but the emperor's dogs took my house and I haven't been back there since.", "_Keyword": "Wild Rose"}]]},
		{"Man by Fountain": "This is the town of Altair."},
		{"Man by Fountain": "The imperial army hasn't arrived here yet, but we cannot hope for that to last forever."},
		{"Boy by Flower Patch": "Tobul the smith in the armor shop can work wonders with his tools."},
		{"Boy by Flower Patch": "But it looks like he's not doing so well these days."},
		{"Man at Northeast": "Pavel's a thief, but he's no baddie. He only steals from those with the empire."},
		{"Gordon": "I am Gordon. I was a prince of Kas'ion. But now, I am nothing more than a coward."},
		{"Gordon": "I left my brother Scott to die on the battlefield."},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Gordon about Wild Rose"},
					{"Gordon": "I see... So you're volunteering, then?", "_Keyword": "Wild Rose"},
					{"Gordon": "I was so afraid Hilda would reject me that I stayed here, wasting away...", "_Keyword": "Wild Rose"}]]},
		{"LOCATION": "- Altair Weapons Shop -"},
		{"Tobul": "Ooh, I'm only a worthless old geezer..."},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Tobul about Wild Rose"},
					{"Tobul": "I'm no shaking bones and skin! I'm Tobul, the master smith for the rebel force!", "_Keyword": "Wild Rose"}]]},
		{"LOCATION": "- Gatrea -"},
		{"Boy": "This is the village of Gatrea. Fynn is across the lake, see?"},
		{"Old Man": "The gates of Castle Fynn have been locked by the imperial army occupying it. We can't go in there."},
		{"Old Man": "The town has changed, too. Now you'll only see imperial soldiers and monsters there!"},
		{"Man": "There is a pub on the outskirts of Fynn. When the empire invaded, the barkeep didn't make it out in time."},
		{"Man": "Now he has to serve imperial soldiers all day long."},
		{"Woman by Armor Shop": "The imperial army hasn't come as far as Altair and Gatrea here, but once the construction of the Dreadnought is finished..."},
		{"LOCATION": "- Fynn Village -"},
		{"Soldier": "Rebels! Meet your fate!"},
		{"ACTION": "Talking with any soldier in the city will result in this message followed by a battle with a Captain in which defeat is likely swift and inevitable. Should your party by some chance be strong enough to win, the soldier will nevertheless remain."},
		{"LOCATION": "- Fynn Pub -"},
		{"Master": "Hey, you, don't come past the counter."},
		{"Master": "I tell ya', the imperial soldiers got no courtesy whatsoever..."},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Master about Wild Rose"},
					{"Master": "There's a secret door in this wall. Inside the room is an injured soldier that I've been taking care of.", "_Keyword": "Wild Rose"},
					{"Master": "He's in your charge now.\" (He departs.)", "_Keyword": "Wild Rose"}]]},
		{"LOCATION": "- Fynn Pub - Secret Room -"},
		{"Scott": "If you intend to sell me to the emperor... kill me. You're not taking me alive."},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Knight about Wild Rose"},
					{"Scott": "! \"Ah, you're rebels, aren't you?", "_Keyword": "Wild Rose"},
					{"Scott": "I am Scott, prince of Kas'ion.", "_Keyword": "Wild Rose"}]]},
		{"Firion": "!!! \"You're Prince Scott? We heard you were killed in combat."},
		{"Scott": "Yes, I am. But my strength is fading."},
		{"Scott": "I've a favor to ask. Deliver a message to my brother, Gordon."},
		{"Scott": "Tell him that he has all the makings of a great leader. He should believe in himself."},
		{"Scott": "And tell the king of Fynn that Count Borgen serves the empire now. That traitor is behind Fynn's downfall!"},
		{"Scott": "And to Hilda..."},
		{"Scott": "My love will be with her always."},
		{"Scott": "No, do not tell her that. I am a dying man."},
		{"Scott": "She should find another love."},
		{"Maria": "Your highness, do you know a man named Leon? He is my brother."},
		{"Scott": "I am sorry, but... I don't.\" (He gets up out of bed.) \"Please, take this Ring. It should prove useful."},
		{"Scott": "Oh, how tired I am..."},
		{"Scott": "Please let me rest now.\" (He collapses and exclamation marks appear over the heads of the party. He vanishes.)"},
		{"SYSTEM": "Obtained Ring"},
		{"LOCATION": "- Altair Village -"},
		{"SYSTEM": "Item - Gordon - Ring"},
		{"Gordon": "Th-That ring belonged to Scott! So he said I should regain my... Thank you, brave ones."},
		{"LOCATION": "- Altair Strategy Room -"},
		{"SYSTEM": "Item - Hilda - Ring"},
		{"Hilda": "! \"That Ring..."},
		{"Hilda": "It's Scott's, isn't it? Is he alive?"},
		{"Firion": "We met the Prince in Fynn. But after he gave us this Ring, his strength gave out, and..."},
		{"Hilda": "So he gave it to you before he died."},
		{"Hilda": "Did he... say anything?"},
		{"Firion": "No, Your Highness. Nothing."},
		{"Firion": "Your Highness, please keep this Ring."},
		{"Hilda": "No, it should remain with you. It belongs with someone of valor."},
		{"Hilda": "So you managed to infiltrate Fynn and return safely. I underestimated you."},
		{"Hilda": "Perhaps you can help us. We need someone to find Myhril, the enchanted metal."},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Hilda about Mythril"},
					{"Hilda": "At the battle of Fynn, the empire's equipment far outclassed ours. We stood no chance against it.", "_Keyword": "Mythril"},
					{"Hilda": "Their forces were armed with weapons and armor made of Mythril.", "_Keyword": "Mythril"},
					{"Hilda": "They must have found a Mythril mine somewhere.", "_Keyword": "Mythril"},
					{"Hilda": "I ordered a man in Salamand named Josef to investigate this possibility, but he has yet to report back.", "_Keyword": "Mythril"},
					{"Hilda": "Please go to Salamand with Mindu and look into the matter.", "_Keyword": "Mythril"}]]},
		{"Mindu": "It is good to see you safely back from Fynn."},
		{"Mindu": "I wish to fight alongside you. I offer my canoe as well."},
		{"SYSTEM": "Mindu joined the party! Obtained Canoe."},
		{"LOCATION": "- Alair Strategy Room -"},
		{"Hilda": "The empire suffered considerable losses in the last great battle in Fynn."},
		{"Hilda": "To make up for them, the imperials are now building the Dreadnought in Bafsk."},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Hilda about Mythril"},
					{"Hilda": "Please find that Mythril as soon as possible!", "_Keyword": "Mythril"}]]},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Hilda about Dreadnought"},
					{"Hilda": "The Dreadnought is massive heavily armored Airship. The empire has enslaved the people of Bafsk to construct it.", "_Keyword": "Dreadnought"}]]},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Hilda about Airship"},
					{"Hilda": "A man named Cid once led Fynn's Order of the White Knights.", "_Keyword": "Airship"},
					{"Hilda": "He built and airship and eventually grew obsessed with it.", "_Keyword": "Airship"},
					{"Hilda": "He left Fynn and settled in Poft, where he now ferries travelers for a fee.", "_Keyword": "Airship"},
					{"Hilda": "I hear every gil he earns goes straight back into the Airship to improve its performance.", "_Keyword": "Airship"}]]},
		{"Rebel Soldier": "Please bring Mythril to Altair!"},
		{"Wizard": "Going to Salamand, are you? Go to the eastern port of Paloom to find a ship that will take you there."},
		{"Wizard": "Youngsters like you would never make it on foot!"},
		{"Soldiers at Door": "Our weapons are no match for the imperial army's."},
		{"Soldiers at Door": "If only we had Mythril!"},
		{"LOCATION": "- Altair Rebel Headquarters -"},
		{"Soldier": "The empire began the construction of their Dreadnought in Bafsk, with the Bafsk townsmen as their slaves."},
		{"Man": "With that Canoe, you should be able to cross the lake on the east to reach Paloom."},
		{"Girl": "If you give Tobul the Mythril, he will forge you some top-notch weapons and armor!"},
		{"LOCATION": "- Altair King's Room -"},
		{"Soldiers at Door": "His Majesty is very pleased with your work. Keep it up!"},
		{"King": "Scott has died... I see..."},
		{"King": "He had asked for Hilda's hand in marriage, but he died before hearing her answer."},
		{"King": "In my eyes, he was most suited to my daughter. It is indeed regrettable."},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask King about Wild Rose"},
					{"King": "The proud crest of Fynn was trampled by the filthy feet of the imperial soldiers!", "_Keyword": "Wild Rose"},
					{"King": "There must have been a traitor.", "_Keyword": "Wild Rose"},
					{"King": "It is simply unthinkable that our army could lose to them!", "_Keyword": "Wild Rose"},
					{"King": "What? It was Borghen who betrayed us? Curses!", "_Keyword": "Wild Rose"}]]},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask King about Mythril"},
					{"King": "Much Mythril was mined and used in ancient times.", "_Keyword": "Mythril"},
					{"King": "The cavern behind the Semitt Falls on the north was a known mine. There are records of it.", "_Keyword": "Mythril"}]]},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask King about Dreadnought"},
					{"King": "Th-The empire is building what? No one has informed me of any such thing... Didn't want to worry me, I suppose.", "_Keyword": "Dreadnought"}]]},
		{"LOCATION": "- Altair Village -"},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Gordon about Mythril"},
					{"Gordon": "Scott wielded a Mythril sword, which was the treasure of Kas'ion. It was truly a magnificent sword.", "_Keyword": "Mythril"}]]},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Gordon about Dreadnought"},
					{"Gordon": "Yes, I have heard the rumors... Once it is finished, it is sure to destroy everything in its path. But what can I do to stop it?", "_Keyword": "Dreadnought"}]]},
		{"Man by Fountain": "I wonder when all of this killing will end and peace returns to us all.\"'"},
		{"Boy by Weapons Shop": "Mythril? Is that food? Gimme some, too!"},
		{"Boy near White Magic Shop": "Take a ship ride from Paloom to Poft. From there head north and you will reach Salamand."},
		{"LOCATION": "- Altair Weapons Shop -"},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Tobul about Mythril"},
					{"Tobul": "\"Only if we had Mythril to forge weapons and armor!", "_Keyword": "Mythril"}]]},
		{"LOCATION": "- Paloom Village -"},
		{"Pirate by Inn": "The empire hasn't attacked Paloom and Poft... yet."},
		{"Pirate by Fountain": "If you take a boat from here, you'll reach Poft."},
		{"Pirate above Inn": "Hey, sugar! Why don't you join me for a drink?"},
		{"Maria": "Eww! Get away from me!"},
		{"Pirate by House": "I hear Bafsk and Salamand have been taken by the empire."},
		{"Pirate above Weapons Shop": "This is Paloom, a little port town, as you can see."},
		{"Girl below Armor Shop": "Paloom is a town of freedom. Why don't you live with me, handsome?"},
		{"Man at Entrance": "Hey, are you looking for a ride? Only 32 gil to Poft!"},
		{"CHOICE": [
				[
					{"ACTION": "Player chooses 'Yes'"},
					{"Man at Entrance": "Deal! Okay, I'll see you at my ship docked outside this town."}],
				[
					{"ACTION": "Player chooses 'No'"}]]},
		{"LOCATION": "- Poft Village -"},
		{"Girl at Entrance": "This is the port of Poft. To the north is Salamand, and to the east is Bafsk."},
		{"Man by Pub": "Hey, are you looking for a ride? Only 32 gil to Paloom!"},
		{"CHOICE": [
				[
					{"ACTION": "Player chooses 'Yes'"},
					{"Man by Pub": "Deal! Okay, I'll see you at my ship docked outside this town."}],
				[
					{"ACTION": "Player chooses 'No'"}]]},
		{"Pirate by Item Shop": "Have you seen the airship?"},
		{"Pirate by Item Shop": "That belongs to a guy named Cid, and he's the only one who can control that thing."},
		{"Pirate in Field": "Cid? You'll find him in the pub here. He'll let you ride on the Airship if you pay him."},
		{"Pirate by Forest": "The town of Bafsk is to our east, but it's been occupied by the imperial army."},
		{"Pirate by Forest": "They're building something horribly big."},
		{"LOCATION": "- Poft Pub -"},
		{"ACTION": "The various pub-goers say the same thing as the Pirate by Forest."},
		{"Cid": "Hey, wanna ride my Airship? You pay the fee and I'll take you anywhere."},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Cid about Dreadnought"},
					{"Cid": "Hey, what's so great about that mess of a machine? Nothing can beat my beauty!", "_Keyword": "Dreadnought"}]]},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Cid about Airship"},
					{"Cid": "If you wanna ride the Airship, give your gil to the guy behind me.", "_Keyword": "Airship"}]]},
		{"Cid's buddy": "You want to ride the only airship in the world?"},
		{"Cid's buddy": "We'll take you anywhere in a flash! Of course, that requires some you-know-what."},
		{"CHOICE": [
				[
					{"ACTION": "Player chooses 'Yes'"},
					{"Cid's buddy": "Where to?"},
					{"CHOICE": [
							[
								{"ACTION": "Player chooses 'Bafsk 100'"}],
							[
								{"ACTION": "Player chooses 'Salamand 200'"}],
							[
								{"ACTION": "Player chooses 'Semit Falls 300'"}],
							[
								{"ACTION": "Player chooses 'Kas'ion 400'"}]]},
					{"Cid's buddy": "Alright, we got a deal. Now we'll prepare for takeoff, so come to the airfield outside this town."}],
				[
					{"ACTION": "Player chooses 'No'"}]]},
		{"LOCATION": "- Bafsk Village -"},
		{"Villagers and Soldiers": "......"},
		{"Leon": "No dawdling here! Away!"},
		{"ACTION": "There is a man here who is a Rebel spy. Talking to him or asking about either Wild Rose or Dreadnought will result in the following..."},
		{"Man": "Fool! Don't speak to me now, the Dark Knight is here! Don't get both of us killed!"},
		{"LOCATION": "- Salamand Village -"},
		{"Woman at Entrance": "The men of Salamand have been enslaved to work in the cavern behind the Semitt Falls."},
		{"Woman at Entrance": "Please help us!"},
		{"Woman by Inn": "Beyond the mountains south of Salamand is the Semitt Falls. The empire has been mining Mythril in the cave above."},
		{"Woman by Josef's House": "I love Josef, but I am afraid I will only be in his way if I am at his side."},
		{"LOCATION": "- Josef's House -"},
		{"Josef": "Yes?'"},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Josef about Wild Rose"},
					{"Josef": "Princess Hilda sent you here? A group of half-pints like you? I find that hard to believe.", "_Keyword": "Wild Rose"}]]},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Josef about Dreadnought"},
					{"Josef": "I know what it is, it's that monster of an Airship.", "_Keyword": "Dreadnought"}]]},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Josef about Airship"},
					{"Josef": "I know who's the Airship expert, but I'm not telling you now.", "_Keyword": "Airship"}]]},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Josef about Mythril"},
					{"Josef": "M-Mythril? Well, um... I haven't found any yet. I've got clues, though...", "_Keyword": "Mythril"},
					{"Josef": "Before I go further, I need you to prove yourselves.", "_Keyword": "Mythril"},
					{"Josef": "The people of Salamand have been put to work in the cavern behind Semitt Falls. If you want to earn my trust, save them.", "_Keyword": "Mythril"}]]},
		{"LOCATION": "- Semitt Falls B3 -"},
		{"Slaves": "Please help me!"},
		{"Molly": "Waaa!"},
		{"Pavel": "You're Firion, right? We met in Altair. Say, maybe you could help me out."},
		{"Pavel": "This girl here is Molly, Josef's daughter."},
		{"Pavel": "Borghen took her and threatened to kill her unless Josef did as he said."},
		{"Pavel": "Why am I here, you ask?"},
		{"Pavel": "Well, I learned this place bore Mythril ore, so I came to get some for myself."},
		{"Pavel": "But they caught me, and here I am."},
		{"Pavel": "Hey, do me a favor and distract the guards. I'll get Molly and the others outta here!"},
		{"Pavel": "See ya later!\" (He and the others leave.)"},
		{"LOCATION": "- Semitt Falls B5 -"},
		{"Sergeant": "You will not leave here alive with the Mythril!"},
		{"ACTION": "The party defeats the soldiers and acquires the Mythril."},
		{"LOCATION": "- Salamand Village -"},
		{"Various Villagers": "Hurry, take the Mythril to the princess in Altair."},
		{"Husband by Inn": "Thank you so much for saving me."},
		{"Wives by Inn": "My husband has returned at last! Thank you so much!"},
		{"Boy at Northwest": "You will need the Snowcraft to travel on the snowfields. I hear Josef keeps one in the cave behind Semitt Falls."},
		{"Boy at Northwest": "There should be a blue rock on the cave's first level. Check the walls nearby."},
		{"LOCATION": "- Josef's House -"},
		{"Molly": "Thank you... for saving me."},
		{"Josef": "Thank you so much for saving my daughter! Borghen threatened me into lying, so I just couldn't tell you the truth."},
		{"Josef": "If there is anything I can do to help you, just let me know."},
		{"SYSTEM": "Item - Josef - Mythril"},
		{"Josef": "You must hurry and take it back to Princess Hilda. She is waiting for you!"},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Josef about Dreadnought"},
					{"Josef": "Since the Dark Knight came as the commander, the Dreadnought's construction has sped up. It will be finished in no time.", "_Keyword": "Dreadnought"}]]},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Josef about Airship"},
					{"Josef": "No one on earth knows more about Airships than Cid.", "_Keyword": "Airship"}]]},
		{"LOCATION": "- Altair Strategy Room -"},
		{"SYSTEM": "Item - Hilda - Mythril"},
		{"Hilda": "Is that Mythril?"},
		{"Hilda": "Wonderful! Please go to the weapon shop and give it to Tobul."},
		{"Hilda": "This is marvelous! Now we can fight the empire on more equal ground."},
		{"LOCATION": "- Altair Weapons Shop -"},
		{"SYSTEM": "Item - Tobul - Mythril"},
		{"Tobul": "Well, now! Is that Mythril in your hands?"},
		{"Tobul": "Good job, laddie. Now I can forge swords, knives, spears and shields... all better than ever!"},
		{"Tobul": "Buy my weapons and armor at the shops. Ooh, this is exciting!"},
		{"Tobul": "I'm busy, don't you see? Shoo! Shoo!"},
		{"LOCATION": "- Altair Village -"},
		{"Gordon": "You... You brought back Mythril? What courage!"},
		{"Gordon": "And what's this? A maiden warrior as well? Most impressive!"},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Gordon about Dreadnought"},
					{"Gordon": "Now you are off to destroy the Dreadnought as well? Oh, if I only had half the strength you had...", "_Keyword": "Dreadnought"}]]},
		{"Man at Northeast": "Thanks to the Mythril you've brought back, Tobul has been able to forge wonderful weapons and armor for the rebel forces."},
		{"Boy by Weapons Shop": "Is Altair going to be taken over by the empire?"},
		{"Boy by Fountain": "The construction of the Dreadnought is taking place in Bafsk."},
		{"LOCATION": "- Altair Rebel Headquarters -"},
		{"Girl": "I hear Bafsk has a new commander now, named Borghen."},
		{"Wizard": "Brave warriors, please destroy the Dreadnought before it is completed."},
		{"Boy by Wizard": "I'm gonna become a rebel and fight against the empire!"},
		{"Soldier": "I've heard the princess of Fynn has formed a rebel force against the empire."},
		{"Soldier": "That is why I am here--- to fight the empire!"},
		{"Boy by Soldier": "Blow up the Dreadnought!"},
		{"Soldier at North Stairway": "Bafsk is under the control of the Dark Knight. Its townsmen have been hypnotized."},
		{"LOCATION": "- Altair King's Room -"},
		{"Soldiers at Door": "The king is greatly reassured by your wonderful work."},
		{"LOCATION": "- Altair Strategy Room -"},
		{"Soldiers at Door": "Please destroy the Dreadnought!"},
		{"Wizard": "Ooooh, I see it! Something enormous and horrible will be shooting across the sky!"},
		{"Soldier": "Once the Dreadnought is finished, the empire will surely come to take over Altair and Poft."},
		{"Hilda": "I hear the Dark Knight leading the Dreadnought's construction is quite an extraordinary man."},
		{"Hilda": "Fortunately for us, he was called back to Palamecia. Perhaps they are scrambling after the loss of the Mythril."},
		{"Hilda": "This is our chance to infiltrate the Dreadnought and destroy it."},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Hilda about Dreadnought"},
					{"Hilda": "One of our comrades in Bafsk has found a way into the Dreadnought. Please go and destroy it.", "_Keyword": "Dreadnought"},
					{"Hilda": "Even delaying its completion would be an immense help.", "_Keyword": "Dreadnought"},
					{"Hilda": "You and Mindu can do it. I have faith in you.", "_Keyword": "Dreadnought"}]]},
		{"LOCATION": "- Bafsk -"},
		{"Townsperson": "You'll need a Pass to enter the Dreadnought."},
		{"Townsperson": "You're rebels, aren't you? Please destroy the Dreadnought."},
		{"Townsperson": "There is a rebel spy disguised as an imperial soldier. Go to him!"},
		{"Townsperson": "We're enslaved to work here. But I don't remember anything about it when the Dark Knight was commanding us."},
		{"Borghen": "Come on, you lazy good-for-nothings! Move it!"},
		{"Borghen": "Mooooove it!"},
		{"Borghen": "Finish its construction as quickly as your pathetic selves can! You're going to advance my position in the imperial army."},
		{"Soldier": "We need the Dark Knight!"},
		{"Soldier": "Come on! Move it! I swear, everyone refuses to work under General Borghen!"},
		{"Soldier": "General Borghen must be firm with them!"},
		{"Spy": "Ever since General Borghen came as the Dark Knight's replacement, it's been easy for us here."},
		{"Spy": "But he sure seems like an idiot--- oops, you never heard that."},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Spy about Wild Rose"},
					{"Spy": "Ah, comrades! I wasn't able to move around when the Dark Knight was commanding this operation.", "_Keyword": "Wild Rose"},
					{"Spy": "Borghen is only a pig-headed fool. He doesn't care about anything but himself.", "_Keyword": "Wild Rose"}]]},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Spy about Dreadnought"},
					{"Spy": "You must be here to destroy the Dreadnought. I'm a spy for the rebel forces, an ally of yours.", "_Keyword": "Dreadnought"},
					{"Spy": "You'll find the entrance to the sewers ahead. It should lead you to the Dreadnought.", "_Keyword": "Dreadnought"},
					{"Spy": "Well, enough talk. Don't want to rouse suspicion. Good luck.\" (He leaves.)", "_Keyword": "Dreadnought"}]]},
		{"LOCATION": "- Bafsk Cave -"},
		{"Leon": "The Dreadnought is complete."},
		{"Leon": "You fools thought I'd return to Palamecia before my duty was done?"},
		{"Leon": "Give up. You stand no chance against the emperor."},
		{"Leon": "I will leave you to think it over. Farewell for now.\" (He exits.)"},
		{"Borghen": "Take that!\" (chuckles maniacally)"},
		{"ACTION": "A cutscene outside shows the launch of the Dreadnought. The party heads to a room inside the cave and opens a treasure chest."},
		{"SYSTEM": "Obtained Pass from the treasure chest."},
		{"LOCATION": "- Bafsk -"},
		{"Townsperson": "The world is coming to an end!"},
		{"Townsperson": "The Dreadnought is now finished! And so is our world!"},
		{"Townsperson": "Go back to Altair. Maybe the princess can figure out how to destroy the Dreadnought."},
		{"Townsperson": "The Dreadnought headed towards Poft."},
		{"Townsperson": "Ask Cid what the Dreadnought's weakness is."},
		{"LOCATION": "- Poft -"},
		{"Girl": "The Dreadnought came and... it opened fire, killing everyone!"},
		{"LOCATION": "- Poft Pub -"},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Cid about Dreadnought"},
					{"Cid": "You only need to blow up the engine of the Dreadnought to blow it to smithereens!", "_Keyword": "Dreadnought"}]]},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Cid about Airship"},
					{"Cid": "The Airship runs on Sunfire, as does the Dreadnought.", "_Keyword": "Airship"}]]},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Cid about Sunfire"},
					{"Cid": "The Sunfire can't be controlled easily. You get too much flame and it might just blow up in your face!", "_Keyword": "Sunfire"}]]},
		{"LOCATION": "- Paloom -"},
		{"Pirate by Item Shop": "Ow! I'm telling you, I'm not gonna make it."},
		{"Pirate near Weapons Shop": "My sweet daughter. She... she died!"},
		{"Pirate above Weapons Shop": "The Dreadnought attacked us!"},
		{"LOCATION": "- Altair Rebel Base -"},
		{"Girl": "Maybe Cid knows the Dreadnought's weakpoint."},
		{"Girl": "After all, he did build the Airship! I'm sure he has all the answers to your machinery questions."},
		{"Boy": "All the people outside the town were killed!"},
		{"Woman": "The Dreadnought attacked us here. But our headquarters somehow survived."},
		{"Man": "We must stop the Dreadnought to stop the destruction."},
		{"Wizard": "Dear lord, I ask thee to save the king's life."},
		{"Boy": "Waaaa! That was so scary!"},
		{"Rebel Soldier": "The Dreadnought finally came to Altair, but fortunately our hideout suffered no damage."},
		{"Rebel Soldier": "We gathered all the townsfolk to take shelter here."},
		{"Wandering Rebel Soldier": "We will hold up here until you return."},
		{"LOCATION": "- Altair Strategy Room -"},
		{"Soldiers at Door": "How can we go against that monstrous Dreadnought?"},
		{"Wizard": "I knew it! Everything was just too much for you lads to handle."},
		{"Wandering Soldier": "The Dreadnought has been finally finished..."},
		{"Hilda": "Many people were hurt in the Dreadnought's attack. Father is heartbroken and his condition has worsened."},
		{"Hilda": "He thinks himself near death..."},
		{"Maria": "Mindu... is there anything we can do?"},
		{"Mindu": "(shakes his head) \"All living creatures must die. It cannot be helped."},
		{"Mindu": "But my duty is to save those who are suffering."},
		{"Mindu": "Go on, continue your journey. I will remain here and take care of the injured ones."},
		{"Mindu": "Firion. The Dreadnought must be destroyed. We cannot endure this much longer."},
		{"SYSTEM": "Mindu left the party."},
		{"LOCATION": "- Altair King's Room -"},
		{"Soldiers at Door": "The king's condition is worsening."},
		{"Mindu": "It is his spirit that is most hurt, not his body."},
		{"Mindu": "This is not something a physician can cure."},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Mindu about Dreadnought"},
					{"Mindu": "The Dreadnought and the Airship both operate on the same mechanical principles.", "_Keyword": "Dreadnought"}]]},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Mindu about Airship"},
					{"Mindu": "Cid gave up everything he had for the Airship... His knighthood, honors, family and all.", "_Keyword": "Airship"}]]},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Mindu about Sunfire"},
					{"Mindu": "Every three years, a ritual of fire is held.", "_Keyword": "Sunfire"},
					{"Mindu": "The Sunfire is transferred to Egil's Torch so its altar can be purified.", "_Keyword": "Sunfire"}]]},
		{"King": "Many good men died in the Dreadnought's attack. I sometimes wonder if we should surrender to the empire."},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask King about Airship"},
					{"King": "The Cid I knew was a kind, righteous man, but that all changed after he became involved with the Airship.", "_Keyword": "Airship"}]]},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask King about Sunfire"},
					{"King": "Scott sealed the gates of Castle Kas'ion to protect the Sunfire, in case his army was defeated.", "_Keyword": "Sunfire"},
					{"King": "You will need the Goddess's Bell to lift the doors again.", "_Keyword": "Sunfire"}]]},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask King about Goddess's Bell"},
					{"King": "Only the Kas'ion clan know the bell's whereabouts.", "_Keyword": "Goddess's Bell"}]]},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Mindu about Goddess's Bell"},
					{"Mindu": "Gordon should know where the bell is... But we do not know where he has disappeared to.", "_Keyword": "Goddess's Bell"},
					{"Mindu": "Someone who has been close to Scott and Gordon may know where it is.\" Princess Hilda, perhaps?", "_Keyword": "Goddess's Bell"}]]},
		{"LOCATION": "- Altair Strategy Room -"},
		{"Hilda": "Thanks to Mindu, Father seems to be in much better condition these days."},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Hilda about Sunfire"},
					{"Hilda": "Sunfire is Kas'ion's symbol. Its light illuminates the castle's ground floor even today.", "_Keyword": "Sunfire"},
					{"Hilda": "I have heard stories about the flame from Scott and Gordon.", "_Keyword": "Sunfire"},
					{"Hilda": "For instance, no ordinary torch can carry it.", "_Keyword": "Sunfire"}]]},
		{"Firion": "Perhaps the Sunfire can destroy the empire's Dreadnought."},
		{"Hilda": "Perhaps it can!"},
		{"Hilda": "Please go to Kas'ion at once. Cid should provide you with transportation."},
		{"Hilda": "But... I wonder how the magical flame can be brought back?"},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Hilda about Goddess's Bell"},
					{"Hilda": "Yes, Scott and Gordon have mentioned that before.", "_Keyword": "Goddess's Bell"},
					{"Hilda": "Kas'ion's doors only respond to the voice of a family member or to the sound of a magical bell.", "_Keyword": "Goddess's Bell"},
					{"Hilda": "The bell is supposedly hidden deep within a cave in the snowlands. You do not intend to go there, I hope.", "_Keyword": "Goddess's Bell"},
					{"Hilda": "Oh, if Gordon were only here, you wouldn't have to risk your lives like this!", "_Keyword": "Goddess's Bell"},
					{"Hilda": "I wonder where he has gone...", "_Keyword": "Goddess's Bell"},
					{"Hilda": "Well, regret is pointless now. I can only pray for your safe return.", "_Keyword": "Goddess's Bell"},
					{"Hilda": "Josef knows the snowfields as he does his own garden. He may have some good advice to offer.", "_Keyword": "Goddess's Bell"}]]},
		{"LOCATION": "- Salamand - Josef's House -"},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Josef about Goddess's Bell"},
					{"Josef": "You will not make it to the ice cavern without my snowcraft.", "_Keyword": "Goddess's Bell"},
					{"Josef": "I hid the snowcraft inside the mines.", "_Keyword": "Goddess's Bell"},
					{"Josef": "On the first level, a blue rock marks the entry to a secret room to the right. It's in there.", "_Keyword": "Goddess's Bell"},
					{"Josef": "Well, let's go!", "_Keyword": "Goddess's Bell"}]]},
		{"SYSTEM": "Josef joined the party!"},
		{"Molly": "Daddy, please come back soon!"},
		{"LOCATION": "- Semitt Falls -"},
		{"SYSTEM": "When Josef pressed in a small rock, a hidden passageway appeared."},
		{"Josef": "The snowcraft is hidden in the back of this room."},
		{"SYSTEM": "Obtained Snowcraft from the treasure chest."},
		{"LOCATION": "- Snow Cavern B5 -"},
		{"Giant Beaver": "Grr, rar, Grrragh?"},
		{"Gus": "I understand animal words."},
		{"Gus": "I speak with him."},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Giant Beaver about Goddess's Bell"},
					{"Gus": "Opening in right wall. Monster protecting bell. Bell inside wall.", "_Keyword": "Goddess's Bell"}]]},
		{"ACTION": "If you speak with any of the other Giant Beavers..."},
		{"Giant Beaver": "Grrargh! Rrrargh!"},
		{"ACTION": "The party proceeds..."},
		{"SYSTEM": "It is the guardian of the Goddess's Bell, Adamantoise!"},
		{"ACTION": "Battle with Adamantoise"},
		{"SYSTEM": "Something is embedded in the wall. It is the Goddess's Bell!"},
		{"SYSTEM": "Obtained Goddess's Bell."},
		{"ACTION": "An opening appears that leads the party back to Snow Cavern B1. At the stairway to the exit..."},
		{"Borghen": "Damn you! You've ruined me!"},
		{"Borghen": "The emperor will not tolerate failure. I can't go back now."},
		{"Borghen": "Well, if I'm going down, you're coming with me!\" (laughs maniacally)"},
		{"ACTION": "Battle with Borghen. Being little more than a joke boss, he is dispatched with haste. Following the battle, he falls and the party sidesteps him and begins to exit the cave. But a little ways down, Borghen gets back up..."},
		{"Borghen": "So you got me, but I'm not going alone. Take my final gift..."},
		{"Borghen": "It's going to be a hell of a ride!\" (laughs maniacally) \"Ha ha! See you down there!"},
		{"ACTION": "He falls and disappears. A boulder appears and begins rolling towards the party."},
		{"Josef": "No, it's coming too fast!\" (He holds it back and shouts to the rest of the group.) \"Now, go! Run!"},
		{"Gus": "You coming with us. We want you come."},
		{"Josef": "Just... go... I can't hold up...too much longer!"},
		{"ACTION": "Firion approaches, but Josef tells him to stop.) \"Go! Now!\""},
		{"ACTION": "The rest of the party heads towards the exit.) \"It's up to you now... Molly, I'm always with you!\" (The boulder slides down and crushes him."},
		{"Firion": "Josef!\" (Josef disappears and the party heads on its way.)"},
		{"LOCATION": "- Salamand -"},
		{"Wandering Wife": "Oh, we miss Josef so..."},
		{"Husband": "Josef died for that bell... Please don't waste his life. Go take it to Kas'ion as soon as possible."},
		{"Wife": "Josef died?"},
		{"Man at Northwest": "The forest south of Kas'ion is known to be a territory of this weird bird, Chocobo."},
		{"LOCATION": "- Josef's House -"},
		{"Girl in Josef's House": "Oh, Josef... I will take care of Molly in his place."},
		{"Girl in Josef's House": "I am sure he will pleased to know that in heaven..."},
		{"Molly": "Daddy isn't gonna come back, is he?"},
		{"LOCATION": "- Altair Strategy Room -"},
		{"Hilda": "So Josef gave his life for that bell..."},
		{"Hilda": "We cannot let Josef die in vain. Please take that bell to Castle Kas'ion at once."},
		{"Hilda": "The Goddess's Bell will allow you to enter Castle Kas'ion. You must depart at once."},
		{"Hilda": "We will meet you there on Cid's airship."},
		{"LOCATION": "- Poft Pub -"},
		{"Cid's buddy": "You want to ride the only airship in the world?"},
		{"Cid's buddy": "We'll take you anywhere in a flash! Of course, that requires some you-know-what."},
		{"CHOICE": [
				[
					{"ACTION": "Player chooses 'Yes'"},
					{"Cid's buddy": "Where to?"},
					{"CHOICE": [
							[
								{"ACTION": "Player chooses 'Bafsk 100'"}],
							[
								{"ACTION": "Player chooses 'Salamand 200'"}],
							[
								{"ACTION": "Player chooses 'Semit Falls 300'"}],
							[
								{"ACTION": "Player chooses 'Kas'ion 400'"}]]},
					{"Cid's buddy": "Alright, we got a deal. Now we'll prepare for takeoff, so come to the airfield outside this town."}],
				[
					{"ACTION": "Player chooses 'No'"}]]},
		{"LOCATION": "- Castle Kas'ion 1F -"},
		{"SYSTEM": "The door is locked."},
		{"SYSTEM": "Item - Door - Goddess's Bell"},
		{"SYSTEM": "The bell rang beautifully and the door opened."},
		{"LOCATION": "- Castle Kas'ion 2F -"},
		{"Gordon": "I thought I was the only one who could retrieve the Sunfire, so I came back here."},
		{"Gordon": "I came looking for Egil's Torch, but I couldn't get past the monsters dwelling here."},
		{"Gordon": "I couldn't just leave empty-handed, so I've been standing here, stuck."},
		{"Maria": "But you know this castle quite well, don't you?"},
		{"Gordon": "(shakes his head) \"This castle is full of secrets that even I don't fully comprehend."},
		{"Gordon": "I cannot guide you, but will you take me with you?\" (The party nods.)"},
		{"SYSTEM": "Gordon joined the party!"},
		{"LOCATION": "- Castle Kas'ion 4F -"},
		{"SYSTEM": "It is the guardian of Egil's Torch, Shrieker!"},
		{"ACTION": "The party defeats Shrieker and gets what they came for."},
		{"SYSTEM": "Obtained Egil's Torch from the treasure chest."},
		{"LOCATION": "- Castle Kas'ion 1F -"},
		{"ACTION": "The party examines the Sunfire."},
		{"SYSTEM": "The Sunfire is burning."},
		{"SYSTEM": "Item - Sunfire - Egil's Torch"},
		{"ACTION": "Firion collects the Sunfire."},
		{"SYSTEM": "The sunfire was moved to Egil's Torch!"},
		{"ACTION": "The party exits Castle Kas'ion and the Dreadnought is shown chasing the Airship. It extends a claw and seizes it. The party is left to make their way on their own back to Altair. They can either walk, or catch a chocobo..."},
		{"LOCATION": "- Chocobo Forest -"},
		{"ACTION": "The party discovers a waiting chocobo, which isn't very difficult to capture."},
		{"SYSTEM": "You've caught a Chocobo!"},
		{"ACTION": "The party makes their way back. When they finally dismount from the chocobo, it flies back to the Chocobo Forest."},
		{"LOCATION": "- Poft -"},
		{"Girl": "This is horrible! Princess Hilda has been captured by the emperor while on the Airship. Please go to Altair at once!"},
		{"LOCATION": "- Paloom -"},
		{"Pirate by Item Shop": "So, Princess Hilda's been caught by the imperial soldiers."},
		{"Pirate by House": "Looks like they're going to win the whole game. Maybe now's the time to join the imperial army!"},
		{"Pirate above Weapons Shop": "I hear Princess Hilda's been captured by the empire, along with Cid's Airship."},
		{"LOCATION": "- Altair Rebel Base -"},
		{"Girl": "If the Dreadnought comes again... it will be the end of us."},
		{"Boy": "Please help Princess Hilda!"},
		{"Woman": "Please destroy the Dreadnought with that Sunfire, so it can never come back!"},
		{"Man": "I could not stop her from boarding the Airship... And now the empire captured her!"},
		{"Man": "Wait! Isn't that the Sunfire of Kas'ion?"},
		{"Wizard": "I hear the empire has a supply station, far north of Fynn. Maybe the Dreadnought is there now."},
		{"Boy": "Waaa! Princess Hilda!"},
		{"Wandering Soldier": "The princess took Cid's Airship to meet you at Castle Kas'ion."},
		{"Soldier": "The princess is captured inside the Dreadnought. Please go rescue her!"},
		{"LOCATION": "- Altair Strategy Room -"},
		{"Soldiers at Door": "Princess Hilda was captured by the Dreadnought!"},
		{"Wandering Soldier": "Our scout reported that the Dreadnought headed towards north of Fynn."},
		{"Wizard": "Princess Hilda was caught. I wonder how you're going to pull off this one."},
		{"LOCATION": "- Altair King's Room -"},
		{"Soldiers at Door": "Please save the princess."},
		{"Mindu": "The princess went to fetch you from Kas'ion personally so she could thank you for all your help."},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Mindu about Dreadnought"},
					{"Mindu": "Even the Dreadnought will need to land and replenish its supplies.", "_Keyword": "Dreadnought"}]]},
		{"King": "Please save my daughter."},
		{"LOCATION": "- Dreadnought 1F -"},
		{"Soldier": "Halt! Who goes there?"},
		{"ACTION": "If you ask the Soldier about Wild Rose..."},
		{"Soldier": "Rebels! Meet your fate!\" (Battle with Captain)"},
		{"ACTION": "Otherwise, if you show him the Pass you found..."},
		{"SYSTEM": "Item - Soldier - Pass"},
		{"Soldier": "Excuse me, sirs! Please go ahead."},
		{"ACTION": "He moves out of the way. If you talk to him again..."},
		{"Soldier": "Oh, time for the next watch. If you will excuse me, sirs...\" (He exits the Dreadnought.)"},
		{"ACTION": "If you talk with any other soldiers on the vessel, you just end up getting into another battle. The party proceeds to a lower level and finds Hilda and Cid inside a prison cell."},
		{"LOCATION": "- Dreadnought 2F -"},
		{"SYSTEM": "The iron bars were forced open!"},
		{"Hilda": "Oh, it is so good to see you! I'm afraid they captured us when we came for you..."},
		{"Hilda": "Well, let's go! Hurry!"},
		{"Cid": "I'll take the princess to the Airship. Look for the engine and toss the Sunfire into it!"},
		{"Cid": "This biggie will blow up then, so I'll have my baby ready for takeoff!"},
		{"ACTION": "He and Hilda leave. If the party returns to the place where they entered, there is now a new soldier blocking the way."},
		{"LOCATION": "- Dreadnought 1F -"},
		{"Soldier": "Hey, no bumming around here! The Princess of Fynn escaped!"},
		{"ACTION": "The party makes their way through the Dreadnought and eventually reaches the engine room."},
		{"LOCATION": "- Dreadnought 5F -"},
		{"SYSTEM": "It seems to be the Dreadnought's engine."},
		{"SYSTEM": "Item - Engine -  Sunfire"},
		{"SYSTEM": "The Sunfire was thrown into the engine!"},
		{"Leon": "Don't think you've won just yet!"},
		{"Maria": "What? Brother, could it be you?"},
		{"Firion": "We've got no time for that now!"},
		{"Firion": "Let's catch Cid's airship!"},
		{"ACTION": "They race out of the Dreadnought and it explodes, completely destroyed. Cid's Airship transports them back to Altair."},
		{"LOCATION": "- Altair Rebel Base -"},
		{"Several NPCs": "The princess was brought back to safety, but now the king..."},
		{"Several NPCs": "His Majesty's condition has worsened!"},
		{"Wizard": "You've destroyed the Dreadnought?"},
		{"Wizard": "Good job, lads! I knew you could do it!"},
		{"LOCATION": "- Hilda's Room -"},
		{"SYSTEM": "Hilda smiles."},
		{"LOCATION": "- Altair King's Room -"},
		{"King": "Gordon, Mindu, Firion..."},
		{"King": "I wish to leave you my final words."},
		{"King": "Gordon, you have grown so much in a short time."},
		{"King": "I would like you to take command of my army. And please, watch over Hilda."},
		{"Gordon": "With my life, Your Majesty!"},
		{"King": "Mindu, I believe the time has come to unseal the Ultima Scroll."},
		{"Mindu": "Yes, Your Majesty. I shall depart immediately."},
		{"King": "Firion, go to Deist.\" 'Deist's Dragoons were decimated, but there must be some survivors."},
		{"King": "We will need the help of both the Wind Drakes and the Dragoons."},
		{"King": "Together, you can restore peace to our people."},
		{"King": "Be strong and keep your faith."},
		{"King": "Please...take care of Hilda...\" (He collapses.)"},
		{"Soldier": "Your Majesty!\" (The King disappears.)"},
		{"Gordon": "This is a terrible loss, but we must go on."},
		{"Gordon": "Now let's go. We have duties to fulfill!\" (He and Mindu exit. The party follows.)"},
		{"LOCATION": "- Altair Rebel Base -"},
		{"Numerous NPCs": "His Majesty has passed away... how are we to overcome this sorrow?"},
		{"Wizard": "Deist, eh? It's an island nation bloody far out in the eastern sea."},
		{"Wizard": "Take a ship from Paloom and go straight south."},
		{"LOCATION": "- Altair King's Room -"},
		{"Gordon": "When the emperor invaded Deist, people only thought it only a minor skirmish."},
		{"Gordon": "But his aim was to exterminate the Dragoons!"},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Gordon about Dragoons"},
					{"Gordon": "I hear even the youngest of Dragoons can communicate with his Wind Drake. But I wonder, can humans really speak to dragons?", "_Keyword": "Dragoons"}]]},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Gordon about Wind Drake"},
					{"Gordon": "You may find a Wind Drake in Deist. If you do, it will surely become a great asset.", "_Keyword": "Wind Drake"},
					{"Gordon": "Go to Paloom and look for a boat that will take you to Deist.", "_Keyword": "Wind Drake"}]]},
		{"LOCATION": "- Altair Rebel Base -"},
		{"Boys": "Someday, I'm gonna fly in the sky on a wind drake's back!"},
		{"Woman 1": "The king has passed away..."},
		{"Girl 1": "The king has passed away..."},
		{"LOCATION": "- Bafsk -"},
		{"Man": "You've done it!"},
		{"Man": "I heard you destroyed the Dreadnought! Miraculous!"},
		{"Man": "Hey, good going."},
		{"Man": "Without their Dreadnought, they're nothing!"},
		{"LOCATION": "- Paloom -"},
		{"Pirates": "You wanna go to Deist? Not on my ship! Go find someone else who's crazy enough to take you there."},
		{"Leila": "You're lookin' for a vessel to Deist? Well, lucky you!"},
		{"Leila": "My ship's about to set sail for that very destination. Care to come along?"},
		{"Maria": "Umm. There's something about this woman..."},
		{"Maria": "I don't know if we should do this."},
		{"Firion": "Hey, but it's for free! Miss, we'd like to take up your offer. Please take us to Deist!"},
		{"Leila": "Now you're talkin'. I'll be waitin' for you outside the town, okay?"},
		{"LOCATION": "- Leila's Ship -"},
		{"Leila": "All right, give up all your belongings. Be lucky I'm sparin' your lives!"},
		{"Leila": "What? You wanna fight against all of us? Bloody fools!"},
		{"ACTION": "Battle with Pirate X 8. They are easily dispatched, each having only minimal HP."},
		{"Leila": "All right, you got us now. Do what you want."},
		{"Leila": "Well, what're you waitin' for? Don't you want to kill us for what we did?"},
		{"Leila": "What? You want us to join your fight against the empire? With rogues like us?"},
		{"Leila": "All right, fellas, to your posts! Buddy, we'll go anywhere in this world with you!"},
		{"SYSTEM": "Leila joined the party!"},
		{"ACTION": "The party gains control of Leila's Ship and makes their way to Deist."},
		{"LOCATION": "- Castle Deist 1F -"},
		{"Child": "Go back! Don't come near!"},
		{"ACTION": "The party approaches the child, a small boy, a second time and talks to him."},
		{"Child": "I... I'm gonna tell Mommy!"},
		{"LOCATION": "- Castle Deist 2F -"},
		{"Child": "Oh, I thought you were the stupid imperial soldiers! Im glad you arent."},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Child about Dragoon"},
					{"Child": "When I get older, Im gonna become a Dragoon like Daddy!", "_Keyword": "Dragoon"}]]},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Child about Wind Drake"},
					{"Child": "The Wind Drake is inside this room. But Mommy says its dying... Tell me its not!", "_Keyword": "Wind Drake"}]]},
		{"Mom": "It seems my son is being a nuisance. Please pardon him. My husband was a Dragoon, but he was killed by the imperials. Only my son and I survived. In the room behind us is the last Wind Drake. It has been trying to speak to us, but I cannot understand it. Every Dragoon carries a special Pendant. Ive heard one was lost in the cavern north of here, only a couple of levels down. With that pendant, we could speak with the Wind Drake. Would you mind looking for it?"},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Mom about Wind Drake or Dragoons"},
					{"Mom": "The Dragoons fought gallantly, but the battle turned against them when the emperor poisoned the Wind Drakes drinking water. All the drakes died one by one, and the Dragoons, without their drakes, lost their edge in battle.", "_Keyword": "Wind Drake or Dragoons"}]]},
		{"LOCATION": "- Castle Deist 2F - Wind Drakes Room -"},
		{"Wind Drake": "Grrr... Rrgh..."},
		{"ACTION": "The party travels the cavern mentioned by the mom and finds what theyre looking for in a small nook a couple levels down."},
		{"LOCATION": "- Deist Cavern B2 -"},
		{"SYSTEM": "A Dragons corpse lies on the ground. Something shines beside it. It is a Dragoons Pendant!"},
		{"SYSTEM": "Obtained Pendant."},
		{"ACTION": "The party returns to the Castle."},
		{"LOCATION": "- Castle Deist 2F -"},
		{"Mom": "The cavern is said to have a spawning ground of the Wind Drakes called the Sacred Spring."},
		{"LOCATION": "- Castle Deist 2F -  Dragons Room -"},
		{"Firion": "Come with us. Lets fight together!"},
		{"Wind Drake": "(growls) The poison has already affected my entire body... I am dying."},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Wind Drake about Dragoons"},
					{"Wind Drake": "Immediately before the battle against the empire began, a Dragoon by the name of Gareth departed in search of the ultimate spell.", "_Keyword": "Dragoons"}]]},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Wind Drake about Wind Drake"},
					{"Wind Drake": "(growls and an egg appears) Kind sirs, please hear my final wish. Take this egg to the cave north of this castle and place it in the spring there. \"This is the last Dragon Egg. Unless someone takes it to the Sacred Spring, it will with and die.", "_Keyword": "Wind Drake"}]]},
		{"SYSTEM": "Obtained Dragon Egg!"},
		{"Wind Drake": "Please... take that egg... to the spring...!"},
		{"ACTION": "The Wind Drake growls and falls over. The party travels to the lowest level of the cavern."},
		{"LOCATION": "- Deist Cavern B5 -"},
		{"SYSTEM": "Chimera stands before the spring!"},
		{"ACTION": "Battle with Chimera"},
		{"SYSTEM": "This is the Sacred Spring."},
		{"SYSTEM": "Item - Sacred Spring - Egg"},
		{"SYSTEM": "The Dragon Egg gently sank to the spring's bottom."},
		{"LOCATION": "- Castle Deist 2F -"},
		{"Child": "*sob* \"The Wind Drake died!"},
		{"Mom": "The last Wind Drake...died. But we still have the egg that you have taken to the spring."},
		{"Mom": "Once it has hatched, it will surely fight for the rebel army. I thank you in place of the mother drake..."},
		{"Mom": "Oh, I wish this did not have to happen!"},
		{"LOCATION": "- Altair Rebel Base -"},
		{"Girl": "The princess is acting quite strange."},
		{"Girl": "She only laughs at whatever I say to her!"},
		{"Boy": "Psst! Hey, do you know what I saw? The princess was eating a rat!"},
		{"Woman": "Oh, the poor Wind Drake!"},
		{"Man": "Prince Gordon has grown into a strong and able leader thanks to your travels together."},
		{"Man": "Princess has locked herself inside her bedroom and wouldn't see anyone. Anyone!"},
		{"Wizard": "The nightmare of having the imperial army raiding us keeps me up all night! I can't sleep anymore!"},
		{"Boy": "Please go talk to Princess Hilda! Nobody knows what's wrong with her!"},
		{"Wandering Soldier": "Miss Leila, the rebel force welcomes you and your men."},
		{"Soldier": "Hey, have you heard? Princess Hilda's acting real weird."},
		{"LOCATION": "- Altair Strategy Room -"},
		{"Soldiers at Door": "Heavens! The last of the Dragoons has died?"},
		{"Wandering Soldier": "Princess has been in a bizarre mood lately... I wonder what has happened to her?"},
		{"Wizard": "Welcome back. It is good to have you back safely."},
		{"Gordon": "Hilda has been acting strangely since her return."},
		{"Gordon": "Will you speak to her and see what may be the cause?"},
		{"Gordon": "I... I don't know what I can do."},
		{"LOCATION": "- Altair King's Room -"},
		{"Soldiers at Door": "Since the king's passing, Gordon has been commanding the rebel force. Brilliantly, too!"},
		{"LOCATION": "- Hilda's Room -"},
		{"Hilda": "Firion, I'd like to speak with you...alone."},
		{"Maria": "We will be waiting for you outside."},
		{"ACTION": "Maria, Gus and Leila exit the room. Hilda goes over to her bed. The screen goes red and a seductive theme begins playing."},
		{"Hilda": "Why are you standing there? Come to me..."},
		{"Firion": "P-Princess? But I shouldn't..."},
		{"Hilda": "Now, now. Don't keep a lady waiting."},
		{"Firion": "I-I mustn't...but...\" (He heads over to Hilda's bed.)"},
		{"Hilda": "Ha! Fool! Die, Firion!"},
		{"ACTION": "The monster that had been impersonating Hilda reveals its true form, a snakelike creature."},
		{"Firion": "Blasted monster! Where's the real Princess Hilda!?"},
		{"Leila": "Not so fast!"},
		{"ACTION": "She and the others reenter the room. Battle with Lamia Queen."},
		{"Firion": "Thank you so much, Leila."},
		{"Leila": "Hey, stay sharp. Women can do scary things sometimes!"},
		{"Gus": "Where real princess?"},
		{"Soldier": "Excuse my intrusion, sirs! But there will be a tournament held in Palamecia and its trophy is said to be Princess Hilda!"},
		{"Gordon": "I am going with you. We must save Hilda!"},
		{"Leila": "Gordon, I know how you feel. We'll take care of this place, so go and do your princey thing."},
		{"SYSTEM": "Gordon joined the party!"},
		{"ACTION": "Leila and the soldier exit the room."},
		{"LOCATION": "- Altair Strategy Room -"},
		{"Soldiers at Door": "I hear the emperor will be at the arena for the tournament. This may be our chance!"},
		{"Wandering Soldier": "I knew something was wrong with the princess, but... We were fooled to believe a monster acting as her!"},
		{"Wizard": "So you're headed for the enemy stronghold... Be careful."},
		{"Wizard": "I threw all sorts comments at you , but that's because I care for you kids!"},
		{"LOCATION": "- Altair King's Room -"},
		{"Soldiers at Door": "I can't believe that she was not the real princess!"},
		{"LOCATION": "- Altair Rebel Base -"},
		{"Girl": "The arena is in Palamecia."},
		{"Boy": "Oh Princess! I hope she has not been harmed in this horrible event!"},
		{"Woman": "Even the Dragoons were no match to the imperial army..."},
		{"Man": "Where is Palamecia, you ask? It's a long way south from Kas'ion."},
		{"Man": "Be careful when crossing the desert of Palamecia. I hear the monsters dwelling there are feared for their deadliness."},
		{"Man": "Mindu hasn't returned from Mysidia yet."},
		{"Wizard": "There is apparently a prison in the understructure of the arena. The princess may be kept there."},
		{"Boy": "Our princess, a trophy to be given away? That's awful!"},
		{"Wandering Soldier": "Prince Gordon, we pray for your safe return."},
		{"Soldier": "Please rescue the princess!"},
		{"Leila": "Don't worry about this place. We'll manage in your absence somehow."},
		{"LOCATION": "- Paloom -"},
		{"Pirate by Item Shop": "Going to the arena? Well, you'd better be careful."},
		{"Pirate by Item Shop": "The arena is at the eastern corner of the Palamecia Desert."},
		{"Pirate by Item Shop": "You'll find it on the south of Kas'ion."},
		{"Pirate by House": "We're cheering for you!"},
		{"Pirate above Weapon Shop": "How's Leila doin'?"},
		{"LOCATION": "- Poft -"},
		{"Girl": "A tournament? It must be a trap! Don't go!"},
		{"LOCATION": "- Coliseum 1F -"},
		{"ACTION": "The party enters the Coliseum and is trapped between two gates."},
		{"Emperor": "Let's begin the battle! The winner will be rewarded with the beautiful Hilda of Fynn!"},
		{"ACTION": "Battle with Behemoth"},
		{"Emperor": "Excellent! Now you shall have your reward!"},
		{"SYSTEM": "Now's your chance to get the emperor!"},
		{"Emperor": "You've put on a wonderful show, Firion."},
		{"Emperor": "You thought I didn't know who you are?"},
		{"ACTION": "He disappears and soldiers surround the party."},
		{"Leon": "Fools... Take them down to their cells."},
		{"ACTION": "The party is trapped in Coliseum B2."},
		{"SYSTEM": "An iron grill bars the way."},
		{"ACTION": "A man shows up and breaks the party out."},
		{"SYSTEM": "? ?"},
		{"SYSTEM": "*Pow!* *Bam!* *Crackle!*"},
		{"Pavel": "So there's my thanks for saving me from the mines! You'd better get moving!"},
		{"LOCATION": "- Coliseum B1 -"},
		{"Firion": "Princess! We will get you out of here!"},
		{"ACTION": "The party unbolts the gate that was barring the way to Hilda."},
		{"Gordon": "Hilda! Are you all right?"},
		{"Hilda": "G-Gordon... you came for me...?"},
		{"Firion": "Gordon! We'll get the guards' attention, so take the princess and go!"},
		{"Gordon": "(nods) \"All right. Be careful!"},
		{"ACTION": "He and Hilda leave. The party makes its way, sans Gordon, back to Altair."},
		{"LOCATION": "- Poft -"},
		{"Girl": "You saved our princess! You're our heroes!"},
		{"LOCATION": "- Paloom -"},
		{"Pirate by Item Shop": "The rebel force began its battle to rewin Castle Fynn from the hands of the empire."},
		{"Pirate by House": "You saved the princess from that arena? Way to go!"},
		{"Pirate above Weapons Shop": "The rebel force has risen!"},
		{"LOCATION": "- Altair -"},
		{"Soldier at Entrance": "Our rebel force has risen at last. First we must rewin Castle Fynn."},
		{"Soldier at Entrance": "Princess Hilda, Prince Gordon... They should all be at the camp outside the castle."},
		{"Soldier at Entrance": "Please go join them at once. We need your help!"},
		{"LOCATION": "- Camp -"},
		{"Soldier": "We've broken our way through the castle entrance. The enemies are in disarray, so now is our chance!"},
		{"Soldier": "Let's recapture our Castle Fynn!"},
		{"Gordon": "Go and infiltrate Castle Fynn to destroy its commander."},
		{"Gordon": "It is best if you go by yourselves, judging from your past success."},
		{"Hilda": "Firion! Maria! Gus! I owe you my life."},
		{"Hilda": "I heard you destroyed the Dreadnought, too. I cannot thank you enough."},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Hilda about Wild Rose"},
					{"Hilda": "Don't worry, I'm the real Hilda.", "_Keyword": "Wild Rose"}]]},
		{"LOCATION": "- Castle Fynn 1F -"},
		{"Leila": "I'm ready to kick some royal butts! Take me with you!"},
		{"SYSTEM": "Leila joined the party!"},
		{"LOCATION": "- Castle Fynn 4F -"},
		{"Gottos": "Rebels! How did they...?"},
		{"ACTION": "Battle with Gottos."},
		{"SYSTEM": "Defeated the enemy's commander!"},
		{"ACTION": "The scene changes and Hilda and Gordon are now sitting in the thrones."},
		{"Hilda": "It is good to be back. I am only sitting here today because everyone came together as a team."},
		{"Hilda": "My most heartfelt thanks to you all."},
		{"Hilda": "But one thing disturbs me. Mindu left for Mysidia and we have not heard back from him."},
		{"Hilda": "Will you please to go to Mysidia to look into the matter?"},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Hilda about Wind Drake"},
					{"Hilda": "You should be able to call the Wind Drake from this Mirror Hall, but it seems the egg hasn't hatched yet.", "_Keyword": "Wind Drake"}]]},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Hilda about Dragoons"},
					{"Hilda": "We do not have the brave Dragoons to help us in battle, but I have you with me.", "_Keyword": "Dragoons"}]]},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Hilda about Mysidia"},
					{"Hilda": "Mysidia is a land of mages. Without their help, we stand little chance against the emperor.", "_Keyword": "Mysidia"},
					{"Hilda": "I hear a mighty spell is sealed within the tower of Mysidia. Two masks hold the key to unbinding it.", "_Keyword": "Mysidia"},
					{"Hilda": "One Mask is white, and the other is black.", "_Keyword": "Mysidia"}]]},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Hilda about Mask"},
					{"Hilda": "Go down to the castle's base level to find the White Mask. I will tell you the magical spell to open the door, so listen carefully.", "_Keyword": "Mask"},
					{"Hilda": "...Ekmet Teloez...", "_Keyword": "Mask"}]]},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Hilda about Ekmet Teloez"},
					{"Hilda": "I am sorry, but I do not know where the door is.", "_Keyword": "Ekmet Teloez"}]]},
		{"Gordon": "Thanks to you all, we have regained Castle Fynn."},
		{"Gordon": "But, Firion, Mindu has not returned."},
		{"Gordon": "Please go and search for him in Mysidia."},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Gordon about Mysidia"},
					{"Gordon": "The tower of Mysidia is said to have the Ultima Scroll, the most powerful spell known to this world.", "_Keyword": "Mysidia"}]]},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Gordon about Ekmet Teloez"},
					{"Gordon": "Hilda knows everything about this castle, but if she doesn't... Hmm...", "_Keyword": "Ekmet Teloez"},
					{"Gordon": "Yes, but of course!", "_Keyword": "Ekmet Teloez"},
					{"Gordon": "Pavel should know any secrets of this castle. He boasts that he is the world's sneakiest thief!", "_Keyword": "Ekmet Teloez"}]]},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Gordon about Ultima Scroll"},
					{"Gordon": "It would certainly be a potent weapon against the emperor!", "_Keyword": "Ultima Scroll"}]]},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Hilda about Ultima Scroll"},
					{"Hilda": "People say that aeons ago, the gate to the underworld opened and a tide of infernal creatures swarmed this land.", "_Keyword": "Ultima Scroll"},
					{"Hilda": "Nothing could stop them until the legendary spell was unleashed.", "_Keyword": "Ultima Scroll"},
					{"Hilda": "It banished the creatures back to the underworld.", "_Keyword": "Ultima Scroll"}]]},
		{"LOCATION": "- Castle Fynn 3F -"},
		{"Soldier at Left": "This is the great hall."},
		{"Soldier at Right": "Prince Gordon awaits you."},
		{"LOCATION": "- Castle Fynn 2F -"},
		{"Soldier at Left": "This is the second floor of Castle Fynn."},
		{"Soldier at Right": "Let's bring back peace together!"},
		{"LOCATION": "- Castle Fynn 1F -"},
		{"Soldier at Left of Stairway": "Princess Hilda and Prince Gordon await you in the great hall."},
		{"Soldier at Right of Stairway": "What could have happened to Mindu? He left for Mysidia but hasn't returned."},
		{"Wandering Soldier at Left": "There's a rumor that a secret on the tower of Mysidia is kept underneath this castle."},
		{"Wandering Soldier at Right": "The town of Mysidia is said to have many ancient tomes. I am sure they will be of great help to you."},
		{"Soldier at Lower Left": "You will find the Hall of the Mirror on top of these steps."},
		{"Soldier at Left of Castle Entrance": "Hooray! Fynn's back in our hands!"},
		{"Soldier at Right of Castle Entrance": "Thank you so much. We can't possibly thank you enough."},
		{"LOCATION": "- Fynn -"},
		{"Man": "Thank you to all , we have been able to rewin Fynn."},
		{"Boy": "You're the ones who beat that big boss, right? Cool."},
		{"Girl": "Coming back to this town has been a dream to me."},
		{"Soldier": "At last, we regained Fynn. The Wild Rose Crest was brought back to grace this land once again."},
		{"Man": "Thank you."},
		{"Man": "Hey, have you seen Pavel yet? He was ecstatic to be back home!"},
		{"Man": "Maybe he had some treasure hidden there."},
		{"Soldier": "We have regained Fynn, but the war is far from ended. It will be impossible to defeat the emperor by ourselves."},
		{"Soldier": "Are there any words from Mindu yet? He hasn't returned from Mysidia."},
		{"Wizard": "Never thought I'd be able to come back to my dear old home. You've done a great deal of good, young'uns."},
		{"LOCATION": "- Fynn - Pavel's House -"},
		{"Pavel": "Well, if it isn't Firion! How goes everything?"},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Pavel about Ekmet Teloez"},
					{"Pavel": "Where's the hidden door in Castle Fynn, you ask? 'Course I know! What's inside?", "_Keyword": "Ekmet Teloez"},
					{"Pavel": "The White Mask? Well, I'm not interested in that piece of royal trash. I'll tell you how to get there.", "_Keyword": "Ekmet Teloez"},
					{"Pavel": "The hidden door is on the upper right corner of the Grand Hall. But what are you going to use a mask for?", "_Keyword": "Ekmet Teloez"}]]},
		{"LOCATION": "- Castle Fynn 4F -"},
		{"ACTION": "The party examines upper right corner of the room and receives a message appears..."},
		{"SYSTEM": "Nothing was found."},
		{"ACTION": "\"There is a hole in the wall... It is a secret door!\""},
		{"LOCATION": "- Castle Fynn B5 -"},
		{"SYSTEM": "Obtained White Mask from the treasure chest."},
		{"ACTION": "The party uses a teleporter just ahead to transport out of the room and continues their quest, now heading for Mysidia..."},
		{"LOCATION": "- Castle Fynn 4F -"},
		{"Hilda": "Take the White Mask to Mysidia. The mages there are sure to know its use."},
		{"Gordon": "The emperor has not been seen of late, but I am sure he is readying another assault."},
		{"Gordon": "Please bring us the Ultima Scroll as soon as possible."},
		{"ACTION": "The party can travel to other towns before Mysidia for bits of optional dialogue..."},
		{"LOCATION": "- Gatrea -"},
		{"Wizard": "Castle Fynn has returned to our hands, at last. We thank you for your bravery!"},
		{"LOCATION": "- Paloom -"},
		{"Pirate by Item Shop": "Mysidia is on the southern content ... It's a far, far place."},
		{"Pirate by House": "You are heroes!"},
		{"Pirate above Weapons Shop": "? \"Fynn's been rewon?"},
		{"LOCATION": "- Poft -"},
		{"Girl": "There is a legend about a secret book that has all the world's secrets written."},
		{"ACTION": "The party continues with its business, onwards to Mysidia..."},
		{"LOCATION": "- Mysidia -"},
		{"Mage at Entrance": "This is Mysidia, the land of magic and mages."},
		{"Mage near Armor Shop": "It is true. The time for unsealing the tower is coming."},
		{"Mage near Inn": "The ancient books kept in this town will give you answers."},
		{"Mage near Item Shop": "The tower's seal is protected by three guardians."},
		{"Mage at Bottom Right Corner (Left)": "Mindu went to the tower a while ago. You must hurry."},
		{"Mage at Bottom Right Corner (Right)": "In the sublevel of Mysidia is a statue of a goddess. It is the guardian of the Crystal Rod."},
		{"Mage at Bottom Left Corner (Higher)": "You will unseal the tower? Then you must collect the two masks and go to the cave north of this continent."},
		{"Mage at Bottom Left Corner (Higher)": "You should find the Crystal Rod there."},
		{"Mage at Bottom Left Corner (Lower)": "Do you have the Black Mask? It is kept on a small island in the middle of the ocean."},
		{"LOCATION": "- Mysidian Library -"},
		{"ACTION": "The party examines a bookshelf and receives a message."},
		{"SYSTEM": "Dusty old tomes fill the bookshelves."},
		{"ACTION": "\"Easy to forge and strong in use. Responds to magical force and is best suited for magical arm and weapons.\""},
		{"ACTION": "\"The ever-advancing technology will eventually force the magicks to vanish.\""},
		{"ACTION": "\"When the world knew no castles and boundaries, a star fell on what is Kas'ion now.\" \"A man took its flames and dedicated an altar to it.\""},
		{"ACTION": "\"There was a king who suffered from thieves stealing his treasures.\" \"His first key was broken on the first night, and the second on the second night.\" \"But the third key remained unbroken -- and so the king hid the key, the Goddess's Bell, in the Snow Cavern.\""},
		{"ACTION": "\"Dragons trained to fly with Dragoons on their back.\" \"Their compact and powerful physique enabled them to carry four to five people at once.\""},
		{"ACTION": "\"The island of Deist was home to the Wind Drakes.\" \"A knight called Haan spent thirty years befriending them, thus becoming the first of the Dragoons.\""},
		{"ACTION": "\"The mages knew very well of their great powers and feared it may cause great destruction if they were entangled into a war.\" \"They therefore established a small hamlet in Mysidia to remain secluded from the world.\""},
		{"ACTION": "\"Offer the White Mask to the goddess underground. If your heart is good, the doppelganger will cease to move.\" \"Place the Black Mask on the doppelganger and it will vanish along with your evilness.\""},
		{"ACTION": "\"Pandaemonium is the palace of demon. When it appeared, the mages conjured a mighty spell and banished it.\" \"The mages then recorded the spell onto a scroll and sealed it deep within a tower.\""},
		{"LOCATION": "- Mysidia - Hidden Altar -"},
		{"SYSTEM": "It is a statue of a goddess."},
		{"SYSTEM": "Item - Goddess Statue - White Mask"},
		{"SYSTEM": "The White Mask was placed over the goddess's face."},
		{"ACTION": "The party travels to the Tropical Island to retrieve the Black Mask. Along the way, they can travel to the top floor and meet up with some islanders who talk funny."},
		{"Tropical Islander": "Oooooh. Looky your weird face. Why no Mask?"},
		{"Tropical Islander": "Oooooh, looky here. Where are you from?"},
		{"Tropical Islander": "Our treasure, the Black Mask, is at the deepest spot here, you see. But no taking it!"},
		{"Tropical Islander": "Don't think you can find it, though. Hehehehehe!"},
		{"ACTION": "The party proceeds to the basement level for the business they came for."},
		{"LOCATION": "- Tropical Island B5 -"},
		{"SYSTEM": "It is the guardian of the Black Mask, Gigan Rhino!"},
		{"ACTION": "Battle with Gigan Rhino"},
		{"SYSTEM": "Obtained Black Mask from the treasure chest."},
		{"ACTION": "The party teleports out and continues their journey..."},
		{"LOCATION": "- Mysidian Cave B1 -"},
		{"SYSTEM": "The doppelganger is not moving. Firion's good heart is binding its movement!"},
		{"SYSTEM": "Item - Doppelganger - Black Mask"},
		{"SYSTEM": "The Black Mask was placed over the doppelganger's face. It vanished with the Black Mask."},
		{"LOCATION": "- Mysidian Cave B5 -"},
		{"SYSTEM": "Obtained Crystal Rod from the treasure chest."},
		{"ACTION": "The party teleports out of the cave and travels to the Mysidian Tower. Just before they reach it, a whirlpool appears and sucks in the ship."},
		{"LOCATION": "- Leviathan - Bowels -"},
		{"Firion": "Where are we?"},
		{"Firion": "Oh no, we've lost Leila!"},
		{"LOCATION": "- Leviathan - Stomach -"},
		{"Man": "You're inside the Leviathan, pal."},
		{"Man": "We were all swallowed by that monster of a snake!"},
		{"Man in Armor": "Halt! Show me proof of your identities!"},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Man in Armor about Ultima Scroll"},
					{"Man in Armor": "But why do you know that?", "_Keyword": "Ultima Scroll"}]]},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Man in Armor about Mysidia"},
					{"Man in Armor": "Yes, I have been to Mysidia.", "_Keyword": "Mysidia"}]]},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Man in Armor about Dragoons"},
					{"Man in Armor": "The Dragoons and the Wind Drakes were annihilated?", "_Keyword": "Dragoons"},
					{"Man in Armor": "What rubbish! I am Dragoon myself!", "_Keyword": "Dragoons"}]]},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Newly IDed Dragoon about Wind Drake"},
					{"Gareth": "Wind Drake? Why ask?", "_Keyword": "Wind Drake"},
					{"Gareth": "Who are you?", "_Keyword": "Wind Drake"}]]},
		{"SYSTEM": "Item - Dragoon - Crystal Rod"},
		{"Gareth": "I see, so you came to obtain the Ultima Scroll as well."},
		{"Gareth": "Let's go together, first out of this monster of a creature."},
		{"Gareth": "The ship is ahead, but a monster is blocking our way."},
		{"SYSTEM": "Gareth the Dragoon joined the party!"},
		{"Man": "It swallowed me too!"},
		{"Girl": "It looks as if we can leave the Leviathan when it opens its mouth. But there is a monster blocking our exit."},
		{"Pirate": "Can we ever leave this place? I'm not going to bury my bones here!"},
		{"Wizard": "The Leviathan is the guardian of the Mysidian Tower. It will swallow anything if it is carrying a Crystal Rod."},
		{"Wizard": "I have a Crystal Rod, too. See?"},
		{"Woman": "Thanks to that grandpa's stupid Crystal Rod, we've all been trapped here!"},
		{"Soldier": "No one can ever leave this place. I'm saying this because I've been trapped inside for the past ten years."},
		{"SYSTEM": "Leviathan - Mouth"},
		{"SYSTEM": "Barrel Worm stands before the ship!"},
		{"ACTION": "Battle with Barrel Worm. Following the battle, the party can immediately enter the Mysidian Tower, or they can return to Deist and Castle Fynn for a bit of optional dialogue..."},
		{"LOCATION": "- Castle Deist -"},
		{"Child": "Are you a Dragoon?"},
		{"Gareth": "Yes, I was a friend of your father's."},
		{"Gareth": "I am going to defeat the emperor now. When I come back, will you let me be your father?"},
		{"Child": "Well, sure. But I hope you can beat that emperor! I'll be praying for it!"},
		{"Mother": "Gareth!"},
		{"Gareth": "Elena! What happened to the others? What about Phillip?"},
		{"Elena": "They didn't make it..."},
		{"Gareth": "No... Courage, Elena."},
		{"Gareth": "I'll be back, I promise. Watch over your son and be strong."},
		{"LOCATION": "- Castle Fynn 4F -"},
		{"Hilda": "Oh, my. You were swallowed by the Leviathan?"},
		{"Hilda": "Speaking of vanishing, I wonder where Mindu is..."},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Hilda about Dragoons"},
					{"Hilda": "Are you... a dragoon?", "_Keyword": "Dragoons"}]]},
		{"Gareth": "Princess Hilda, it is my honor to be in your presence. I am Gareth Highwind, a dragoon."},
		{"Gareth": "When Deist was seized by the empire, I left to retrieve the Ultima Scroll in Mysidia."},
		{"Gareth": "It was there I found Firion's party."},
		{"Gordon": "A Dragoon joined you? Magnificent! The emperor will meet his fate soon!"},
		{"Leila": "When that storm came and the ship broke off... I thought I lost you all for good. Dear lord of the seas!"},
		{"ACTION": "The party resumes its business, heading to the Mysidian Tower. Examine it on the World Map with \"X\" and the Crystal Rod is used to open. The party proceeds up three floors and then encounters a mage blocking the path..."},
		{"LOCATION": "- Mysidian Tower 3F -"},
		{"Mage": "You have done well. But you must defeat me to proceed!"},
		{"SYSTEM": "The mage began to grow!"},
		{"ACTION": "Battle with Fire Gigas. The scenario is repeated on 5F and 7F, first with an Ice Gigas and then with a Thunder Gigas. The party continues to the tenth floor."},
		{"LOCATION": "- Mysidian Tower 10F -"},
		{"Mindu": "You've come at last!"},
		{"Mindu": "The magic seal on this door is strong. I will give it all I have."},
		{"Mindu": "Stand back!"},
		{"ACTION": "Mindu uses a powerful spell to break the seal, draining his life force in the process."},
		{"Maria": "Mindu!"},
		{"Mindu": "I...I have fulfilled my duty. The door... has opened."},
		{"Mindu": "Now...go...!"},
		{"Firion": "Mindu!"},
		{"ACTION": "Mindu disappears and the party nods, then continues into the next room. There they find a room with four silver crystals and a gold crystal in the middle of all of them. The silver crystals each grant a +10 stat boost to a random member of the party."},
		{"SYSTEM": "The crystal responded. \"I shall give thee power.\" Strength increased!"},
		{"SYSTEM": "The crystal responded. \"I shall strengthen your spirit.\" Spirit increased!"},
		{"SYSTEM": "The crystal responded. \"I shall give thee intelligence.\" Intelligence increased!"},
		{"SYSTEM": "The crystal responded. \"I shall give thee speed.\" Agility increased."},
		{"ACTION": "The party proceeds to the golden crystal."},
		{"SYSTEM": "The crystal responded. \"I shall give thee the forbidden spell.\" Obtained Ultima Scroll!"},
		{"ACTION": "A warp point appears and the party teleports out. As they make their way back to Fynn, they find that stronger monsters have populated the World Map and that several villages have been destroyed utterly. There is a Cyclone perched just above and to the right of Fynn on the World Map. Before returning to Fynn, the party can travel back to Mysidia for some optional dialogue..."},
		{"LOCATION": "- Mysidia -"},
		{"Mage at Entrance": "You've bravely unsealed the spell. Now go back to Fynn. Your princess awaits you."},
		{"Wandering Mage near Armor Shop": "I see, Mindu has... fulfilled his destiny. We can only pray for his spirit to rest in tranquility."},
		{"Mage near Inn": "The empire's Cyclone has attacked the northern territory. You must return to Fynn at once!"},
		{"Mage by Water": "Well, now! You have gained some strength and skills, haven't you?"},
		{"Mage at Lower Right Corner (Left)": "The emperor's power surpassed our imagination."},
		{"Mage at Lower Right Corner (Right)": "Go back to the castle. This is the time to call forth the Wind Drake you have saved from death."},
		{"Mage at Lower Left Corner (Left)": "You have Mysidia's power with you. You can do it."},
		{"Mage at Lower Left Corner (Right)": "The Jade Passage comes with the demons."},
		{"LOCATION": "- Fynn -"},
		{"Boy": "Everybody's dead!"},
		{"Soldier": "The Cyclone stormed this town, destroying everything in its path."},
		{"LOCATION": "- Fynn - Pavel's House -"},
		{"Pavel": "Look, I gotta be honest. Your next target is a Cyclone. I don't know how you can get that one."},
		{"LOCATION": "- Castle Fynn 1F -"},
		{"Soldier at Left of Entrance": "The emperor's Cyclone devastated towns like Altair and Poft."},
		{"Soldier at Right of Entrance": "Fynn won't be able to hold up against another Cyclone raid!"},
		{"Wandering Soldier at Right": "Is there not anything we can do to defeat the emperor's magic power?"},
		{"Wandering Soldier at Left": "The emperor created that Cyclone with his magic."},
		{"Soldier at Bottom Left Corner": "The mirror is on the third floor."},
		{"Soldier at Left of Stairway": "No, it's impossible to go inside the Cyclone! It will shred you in pieces!"},
		{"Soldier at Right of Stairway": "The emperor is inside that Cyclone."},
		{"LOCATION": "- Castle Fynn 4F -"},
		{"Hilda": "The emperor has created a Cyclone and has already destroyed Altair, Gatrea, Paloom and Poft... It is now coming to Fynn!"},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Hilda about Wind Drake"},
					{"Hilda": "Long ago, people used to reflect the light of Pendant on the castle's mirror to call a Dragoon and his Wind Drake.", "_Keyword": "Wind Drake"}]]},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Hilda about Cyclone"},
					{"Hilda": "The emperor himself must be controlling the Cyclone.", "_Keyword": "Cyclone"}]]},
		{"Gordon": "We made you retrieve the Ultima Scroll, but I am afraid the Cyclone will swallow us all before we can use it."},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Gordon about Cyclone"},
					{"Gordon": "It will be impossible to permeate the wall of wind from the ground.", "_Keyword": "Cyclone"}]]},
		{"LOCATION": "- Fynn - Pavel's House -"},
		{"ACTION": "\"Oh, please. Now you're going inside that thing? I tell you...\" \"Well, maybe I can help you. I'll give you my treasure. Search the wall next to the bed.\""},
		{"LOCATION": "- Castle Fynn 3F (Hall of the Mirror) -"},
		{"ACTION": "The party examines the mirror."},
		{"SYSTEM": "The mirror is polished to perfection."},
		{"SYSTEM": "Item - Mirror - Pendant"},
		{"SYSTEM": "The mirror is absorbing the light emanating from the Pendant."},
		{"SYSTEM": "A reflection of a Wind Drake can be seen on the mirror. It is the Wind Drake hatched from the Dragon's Egg! The Wind Drake is flying towards Fynn."},
		{"ACTION": "A cutscene shows the Wind Drake's flight to Fynn and the Wind Drake arrives in the room."},
		{"SYSTEM": "The Dragoon and the Wind Drake were brought together at last!"},
		{"LOCATION": "- Castle Fynn 4F -"},
		{"Hilda": "Oh, a Wind Drake! It still seems quite young, but wonderful!"},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Hilda about Wind Drake"},
					{"Hilda": "Perhaps the Wind Drake can take you inside the Cyclone.", "_Keyword": "Wind Drake"}]]},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Hilda about Cyclone"},
					{"Hilda": "I hope the drake's wings are strong enough to withhold the enormous force of the Cyclone!", "_Keyword": "Cyclone"}]]},
		{"Gordon": "The wind velocity in the center of the Cyclone is much weaker, I hear."},
		{"ACTION": "The party approaches the Cyclone from the World Map. Hit \"X\" and the Wind Drake flies into the Cyclone. The party proceeds to the top."},
		{"LOCATION": "- Cyclone 7F -"},
		{"Emperor": "I am not wasting my time on the likes of you."},
		{"Emperor": "Men, take them out."},
		{"ACTION": "Battle with Royal Guard X 2"},
		{"Emperor": "Hmm, not bad. Then how about this?"},
		{"ACTION": "Battle with Royal Guard X 4"},
		{"Emperor": "You surprise me. I suppose I have to silence you myself."},
		{"ACTION": "Battle with Emperor, Royal Guard X 2 and Wood Golem"},
		{"Emperor": "I... will... not... die!\"'"},
		{"Firion": "Let's go back to Fynn!"},
		{"LOCATION": "- Castle Fynn 4F -"},
		{"Hilda": "Thanks to your bravery, peace has finally returned."},
		{"Hilda": "Let us celebrate."},
		{"ACTION": "The party joins a lovely dance. It continues for a while and then a rebel soldier enters the room."},
		{"Soldier": "Y-Your Highness! Leon, the Dark Knight, has claimed... himself as...the emperor!\" (falls and disappears)"},
		{"Hilda": "Oh, no... When is the suffering going to end? But what can we do now? And who is Leon?"},
		{"ACTION": "Scene change. Firion is shown entering the great hall and you can talk with Hilda, Gordon and Leila."},
		{"Hilda": "The Dark Knight is Leon... And he was your friend!"},
		{"Maria": "I'll try to persuade him somehow. He must be controlled by the emperor's magic!"},
		{"Hilda": "The Dark Knight must be in Palamecia as the next emperor."},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Hilda about Palamecia"},
					{"Hilda": "Castle Palamecia is nestled among the mountains. You cannot reach it on foot.", "_Keyword": "Palamecia"}]]},
		{"Gordon": "Leon is Maria's brother."},
		{"Gordon": "You're not going to fight him, are you?"},
		{"Firion": "That is why we must go ourselves."},
		{"Gordon": "I expected that answer from you. Please be careful."},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Gordon about Palamecia"},
					{"Gordon": "It is an impregnable fortress. Pavel was boasting of his past entry into it, but no one knows for sure.", "_Keyword": "Palamecia"}]]},
		{"Leila": "I heard the Dark Knight proclaimed himself the next emperor."},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Leila about Palamecia"},
					{"Leila": "Yeah, I've heard of Pavel's bluffin' about how he snuck in there. You've heard it, too?", "_Keyword": "Palamecia"}]]},
		{"LOCATION": "- Castle Fynn 1F -"},
		{"Soldier at Left of Stairway": "The imperial army is in disarray. Maybe this is our change to defeat the Dark Knight."},
		{"Soldier at Right of Stairway": "You are the only ones who can enter Castle Palamecia. Please defeat the Dark Knight and bring back peace to us all!"},
		{"Wandering Soldier at Left": "We must overthrow the Dark Knight and Palamecian rule."},
		{"Wandering Soldier at Right": "If we defeat the Dark Knight, all the monsters ravaging this world will vanish, too."},
		{"Soldier at Bottom Left Corner": "Pavel was bragging about sneaking in to Palamecia!"},
		{"Soldier at Left of Entrance": "How can one enter Palamecia?"},
		{"Soldier at Right of Entrance": "Castle Palamecia is the imperial army's stronghold, but all the mountains around it block our way."},
		{"LOCATION": "- Fynn -"},
		{"Boy": "Hey, when's it gonna be all safe and peaceful again?"},
		{"Soldier": "Is it true the Dark Knight claimed himself as the emperor?"},
		{"LOCATION": "- Fynn - Pavel's House -"},
		{"Pavel": "What? We finally defeated the emperor, and now we got this Dark Knight to get to?"},
		{"Cid": "The Cyclone got me in Paloom... My old bones aren't acting as I want them to.\" (He lies down on the bed.)"},
		{"Gus": "Are you all right, Cid?"},
		{"Cid": "I'm in this pathetic state now, but my Airship's as scratchless as she ever was."},
		{"Cid": "Now, listen, I'll let you use her until I get better. Got that?"},
		{"Cid": "Take good care of her... Urgh..."},
		{"Firion": "Cid! No, don't-!"},
		{"ACTION": "Cid disappears."},
		{"Pavel": "That was his will, don't you see? Ever since he realized he was dying, he's been meaning to give his Airship to you guys."},
		{"Pavel": "He really loved his Airship, it meant everything to him. You've gotta understand how he felt when he breathed his last words!"},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Pavel about Palamecia"},
					{"Pavel": "Glad you asked. You know how I did it? I glided onto the castle roof with a kite!", "_Keyword": "Palamecia"},
					{"Pavel": "Hey, maybe you guys can take the Airship to get there too!", "_Keyword": "Palamecia"}]]},
		{"ACTION": "The party travels to Palamecia and uses the Airship, dropping down to the seventh floor of the castle. A hole in the ground drops them down to the first floor, but they make their way back up, eventually reaching the eighth floor."},
		{"LOCATION": "- Castle Palamecia 8F -"},
		{"Leon": "I knew you'd come, Firion."},
		{"Leon": "You think you can defeat me?"},
		{"Maria": "No, please stop this! Why do you have to cross your sword against your friend?"},
		{"Leon": "Let me ask you one thing: What conquers the world?"},
		{"Leon": "The answer is power. I am the emperor now, and I will not let go of it!"},
		{"Leon": "Now, move out of my way!"},
		{"ACTION": "A figure appears at the throne where Leon was previously."},
		{"Emperor": "Leon, I'm surprised to see you on my throne."},
		{"Emperor": "I have returned from hell with the ultimate power to conquer the world."},
		{"Emperor": "You? The emperor? Ha! You do not know that you only deserve to work in the shadows of the real emperor!"},
		{"Leon": "What can a ghost do now? The empire is mine!"},
		{"ACTION": "Blue flames surround the party."},
		{"Emperor": "You, pathetic fool. I'm not interested in the empire anymore."},
		{"Emperor": "I shall kill all living souls and destroy this world!"},
		{"Emperor": "You will be joined by the others soon."},
		{"ACTION": "The blue flames move in closer."},
		{"Gareth": "We must flee this place, now. Take my Wind Drake!"},
		{"Firion": "Gareth! What are you doing?"},
		{"Gareth": "Come, I will take you to where you belong."},
		{"Emperor": "You.. You worthless fool!"},
		{"Gareth": "Rrraaaagh!"},
		{"Maria": "Gareth!"},
		{"ACTION": "The Wind Drake appears and ferries the party away A bright light appears and seems to destroy Castle Palamecia, but then it rises again. The party returns automatically to the great hall, the fourth floor of Castle Fynn."},
		{"LOCATION": "- Castle Fynn 4F -"},
		{"Hilda": "Firion, what happened?"},
		{"Hilda": "You! The Dark Knight!"},
		{"Hilda": "Tell me, what happened?"},
		{"Firion": "The emperor... He has returned."},
		{"Maria": "And the dragoon... He sacrificed himself to save us."},
		{"Maria": "Josef, Mindu, Cid, and now Gareth... They're all dead. I can't take this anymore!"},
		{"Leon": "But if we stop here, the emperor will bring more deaths."},
		{"Firion": "Leon... let's fight together."},
		{"Firion": "Princess Hilda, please allow him to join us."},
		{"Hilda": "I will leave the decision up to you."},
		{"Maria": "Leon, we'll go together!"},
		{"Leon": "Okay, Maria."},
		{"Hilda": "Long ago, demonic creatures flooded the world in what is now known as the Tide of Doom."},
		{"Hilda": "It is said they entered through a place called the Jade Passage."},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Hilda about Jade Passage"},
					{"Hilda": "There is an area of Mysidia known by that name.", "_Keyword": "Jade Passage"}]]},
		{"Gordon": "The resurrected emperor brought Pandaemonium from the underworld! The world is coming to an end!"},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Gordon about Jade Passage"},
					{"Gordon": "Kas'ion folklore told of a small lake in Mysidia. It was said to be the portal to hell.", "_Keyword": "Jade Passage"}]]},
		{"Leila": "That emperor sold his soul to the demons, that's just what he did."},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Leila about Jade Passage"},
					{"Leila": "You know that narrow channel on the east of Mysidia? That's where the Jade Sea is.", "_Keyword": "Jade Passage"}]]},
		{"LOCATION": "- Castle Fynn 1F -"},
		{"Secret Soldier": "We're all going to die! Waaaa!"},
		{"Soldier at Left of Stairway": "The emperor's spirit has returned from hell."},
		{"Soldier at Right of Stairway": "This is horrible!"},
		{"Wandering Soldier at Left": "We must return the emperor's spirit back to hell."},
		{"Wandering Soldier at Right": "Pandaemonium is a castle of mirage, so you cannot enter it directly. I hear there is a spring leading the world of demons, but..."},
		{"Soldier at Bottom Left Corner": "How horrible. The emperor came back to this world in his spirit form!"},
		{"Soldier at Left of Entrance": "Pandaemonium, the floating palace of hell appeared!"},
		{"Soldier at Right of Entrance": "Castle Palamecia collapsed, but the emperor returned-- this time, bringing Pandaemonium with him."},
		{"Soldier at Right of Entrance": "He must be there."},
		{"LOCATION": "- Fynn -"},
		{"Boy": "What's gonna happen to the world?"},
		{"Soldier": "The emperor has come back from his death..."},
		{"LOCATION": "- Fynn - Pavel's House -"},
		{"Pavel": "Just don't waste your life, Firion promise me that, all right?"},
		{"ACTION": "The party travels to Castle Deist for some optional dialogue and a bonus item."},
		{"LOCATION": "- Castle Deist 2F -"},
		{"Child": "We gotta get rid of that emperor's apparition! Hey, what happened to the Dragoon you went with?\" (Elena sobs.)"},
		{"Mother": "Gareth is dead? But he promised me he'd return..."},
		{"Mother": "Still, he was a Dragoon. He must have been proud to die for his comrades."},
		{"CHOICE": [
				[],
				[
					{"ACTION": "Ask Mother about Dragoons"},
					{"Mother": "We will be leaving Deist. This is our home, but... it's too full of painful memories.", "_Keyword": "Dragoons"},
					{"Mother": "Oh, I meant to give you this. Only the greatest Dragoons could wield it. It's yours now.", "_Keyword": "Dragoons"}]]},
		{"SYSTEM": "Obtained Excalibur!"},
		{"ACTION": "She and her son exit. The party can also return to the house in Mysidia, where the book there has info on the keywords Palamecia and Jade Passage."},
		{"ACTION": "\"The Palamecian king then boasted-  If you succeed to enter this castle, you may have my daughter!\" \"Many suitors came but all failed. Finally, a lad on a bag filled with hot--air landed on its roof and floated away with the princess.\""},
		{"ACTION": "\"A passage to Pandaemonium, the palace of demons.\""},
		{"ACTION": "The party travels to the Jade Passage, which they pass through without any dialogue. There, they find a teleporter that transports them into the final dungeon, Pandaemonium."},
		{"LOCATION": "- Pandaemonium 1F -"},
		{"SYSTEM": "You have entered Pandaemonium!"},
		{"LOCATION": "- Pandaemonium 10F -"},
		{"ACTION": "The party speaks with the Emperor, who is waiting at the center at the very top."},
		{"Emperor": "So good to see you again. But this time, you are the ones who will die."},
		{"ACTION": "Battle with Emperor."},
		{"Emperor": "B-But why... Why cannot I defeat...you...?"},
		{"Emperor": "Who... are..."},
		{"Emperor": "y--you...?"},
		{"Emperor": "Rrrraaaaagh!"},
		{"Firion": "(saluting) \"Let's get out of here!"},
		{"ACTION": "The others nod. Note - the above line is not specifically credited to any of the characters, but since it's Firion who salutes and the others who nod, it would seem that it's him who says it. The screen fades to black, then fades back in at Castle Fynn 4F. The party enters the room. Firion, Maria and Gus stand together, while Leon goes and stands off to the side, nearby Pavel, Mollly and Leilia, who have gathered there."},
		{"LOCATION": "- Castle Fynn 4F -"},
		{"Hilda": "I am glad you returned."},
		{"Gordon": "You have done it. You are our heroes!)"},
		{"ACTION": "He and Hilda go and stand by their thrones and Pavel approaches the party."},
		{"Pavel": "You made it back! Amazing! I don't know whether you're brave or just lucky. Well, take care.\" (He leaves.)"},
		{"Leila": "Hey, I always knew you could pull that off. Drop by anytime you see my ship, I'll be lookin' forward to seein' you again!\" (She leaves.)"},
		{"Molly": "You're our heroes! My father must be so proud of you, too."},
		{"Molly": "I've decided to work here in the castle, serving the princess. It is the least I can do.\" (Josef's spirit appears and then flickers away.) \"Josef!"},
		{"ACTION": "Molly walks away and stands between Hilda and Gordon."},
		{"Hilda": "We will dedicate our lives to restoring what has been destroyed."},
		{"Hilda": "We hope to see you again... please take care!"},
		{"ACTION": "She, Gordon and Molly leave."},
		{"Gus": "Everything...ended."},
		{"Firion": "That's right!"},
		{"Maria": "We can all live together again, all four of us!"},
		{"Firion": "(nods) \"..."},
		{"ACTION": "They all turn to face Leon."},
		{"Maria": "Right, Leon?"},
		{"ACTION": "Leon walks over to the group and they turn around to face each other."},
		{"Leon": "We've been through too much. We can't return to the past."},
		{"ACTION": "He turns away."},
		{"Maria": "Wait, Leon! Why? Firion, please don't let him go!"},
		{"Firion": "What Leon said is true, Maria."},
		{"Firion": "I can't stop him from going."},
		{"ACTION": "Leon begins to walk away."},
		{"Firion": "We shall meet again, Leon!"},
		{"ACTION": "Leon leaves. The others begin to leave. As they do, they turn around again and the ghosts of those who sacrificed their lives to aid them appear- Scott, Josef, Mindu and Gareth. They flicker and then disappear."},
		{"Firion": "Now, let's go. This is going to be the real beginning!"},
		{"ACTION": "Gus nods. They leave and the screen fades to black. The ending sequence then plays. Scenes of the restored peace are played and text appears in italics..."},
		{"SYSTEM": "The long war ended at last. The emperor and Pandaemonium... and the monsters plaguing every corner of the world... They all vanished. Peace has finally returned. The people will slowly heal the scars of war. The memory of those dismal days will fade with time. But one memory will remain clear and true - It was the ordinary youths with extraordinary minds who saved the world."},
		{"SYSTEM": "Final Fantasy II"}]
}