{"text": [
		{"LOCATION": "Chapter 1 - *Arrivals*"},
		{"LOCATION": "EXTERIOR: OVERWORLD . CONERIA PRAIRIE (Opening of Prologue)"},
		{"ACTION": "A warrior in training (as well as the remaining three LIGHT WARRIORS. just not visible due to Squre's party design [Ed: Square fans have taken notice of this and Square has now, for the first time ever in the FF series, created multiple characters on the overworld for FF8; ala Dragon Quest!) stands transfixed, facing east, as if to greet the morning sun. To the north lies a bustling town named Coneria. It's magnificant castle looms high enough to touch the passing clouds. Surrounding this city is a great forest. acting as it's ever-vigilant guardian. To the south, a port for docking ships is apparent. The adventurers venture northward..."},
		{"LOCATION": "EXTERIOR: CONERIA . SOUTH ENTRANCE"},
		{"ACTION": "The party of four warriors saunters into the town. It appears an average town (aside from a bubbling brook that runs though it) with the usual going-on's. An inn is located near the entrance, a weapons and armor shop is on the west end. Further north holds training centers for magicians to be. An useful item shop is to the east, and above it lies the clinic for the sick and hurt citizens. In the center of the town we see a refreshing water fountain. Several Conerian soldiers patrol the town to uphold order and to protect the citizens from whatever should arise."},
		{"Woman 1": "This is Coneria, the dream city.", "_Comment": "greeting"},
		{"LOCATION": "EXTERIOR: CONERIA . WATER FOUNTAIN"},
		{"Arylon": "I am Arylon, the Dancer!", "_Comment": "bearing some skin ta boot"},
		{"COMMENT": "NOTE: Inspection of the 'fountain' merits you this text.."},
		{"ACTION": "See your face upon the clean water. How dirty! Come! Wash your face!"},
		{"LOCATION": "EXTERIOR: CONERIA . OUTSIDE SHOPS"},
		{"First Officer": "WARRIORS. Revive the Power of the ORBS!"},
		{"COMMENT": "NOTE: Inspection of a 'well' merits you this text.."},
		{"ACTION": "This is a well. You might think that there is something to it. But in fact it is just an ordinary well."},
		{"LOCATION": "EXTERIOR: CONERIA . NEAR MAGIC CENTERS"},
		{"Elderly Woman": "Please! Save the Princess!"},
		{"LOCATION": "EXTERIOR: CONERIA . BEHIND BLACK MAGIC CENTER"},
		{"Old Man": "Lukahn left this town, to join his colleagues at Crescent Lake."},
		{"LOCATION": "EXTERIOR: CONERIA . NORTH ENTRANCE"},
		{"Guard 1": "The King is sure that someday the LIGHT WARRIORS will come to save the Princess, just as in Lukahn's prophecy."},
		{"LOCATION": "EXTERIOR: CONERIA . OUTSIDE OF CLINIC"},
		{"LOCATION": "EXTERIOR: CONERIA . EAST ENTRANCE"},
		{"Boy": "My home is Pravoka, a beautiful port city far east of here."},
		{"COMMENT": "(FTR, the population of Coneria is a scant 15. including the guards and the employees of the shops and services.)"},
		{"LOCATION": "EXTERIOR: CONERIA CASTLE"},
		{"ACTION": "Exiting Coneria, the party expediently approaches the awe-inspiring castle. towering high above: it's citizens, the town, and the great forest that surrounds and protects it. A beacon to civilization and an monument to a thriving economy."},
		{"LOCATION": "INTERIOR: CONERIA CASTLE . FIRST FLOOR . FRONT ENTRANCE"},
		{"ACTION": "The warriors boldly enter the spacious and palatial Coneria Castle. A great hall of colossal marble pillars spans athwart many times over. They are eagerly greeted and questioned by a guard."},
		{"Guard 2": "The King is looking for the LIGHT WARRIORS. You do not happen to be them do you?"},
		{"LOCATION": "INTERIOR: CASTLE CONERIA . FIRST FLOOR . SMALL LIVING QUARTERS"},
		{"COMMENT": "(The warriors decide to do a little snoopin' before they talk to the King..WITH permission, of course.) Inside the room there is a table and four stools. Toward the back of the room is a fireplace which is lavishly constructed of the finest medals and stone in the land."},
		{"Princess's Sister": "Oh.  My sister.", "_Comment": "worried"},
		{"ACTION": "The warriors explore further.."},
		{"LOCATION": "INTERIOR: CASTLE CONERIA . FIRST FLOOR . OUTSIDE OF QUEEN'S CHAMBERS"},
		{"Queen's Guard": "In sadness, the Queen locked herself inside."},
		{"LOCATION": "INTERIOR: CONERIA CASTLE . FIRST FLOOR . INSIDE QUEEN'S CHAMBERS (obviously, heshe lets you inside)"},
		{"ACTION": "Perched on a throne, sits the Queen contemplating her daughter's fate. She feels sorrow for her but is helpless to remedy the situation. The same baroque fireplace sits in the rear of the room."},
		{"Queen Jane": "I am Jane, Queen of Coneria. Please save my daughter, Princess Sara."},
		{"LOCATION": "INTERIOR: CONERIA CASTLE . FIRST FLOOR . HALLS WEST OF STAIRS"},
		{"ACTION": "INVISIBLE (yes, invisible) WOMAN: (s) The Princess was looking for you!"},
		{"Scholar": "Garland used to be a good knight until."},
		{"LOCATION": "INTERIOR: CONERIA CASTLE . FIRST FLOOR . NORTHERN HALL (still exploring)"},
		{"Old Man": "400 years ago the Treasury was locked by the mystic KEY. Our ancestors gave the KEY to the Prince of ElfLand for safekeeping."},
		{"LOCATION": "INTERIOR: CONERIA CASTLE . FIRST FLOOR . OUTSIDE TREASURY"},
		{"Old Man": "400 years ago the Treasury was locked by the mystic KEY. Our ancestors gave the KEY to the Prince of ElfLand for safekeeping."},
		{"LOCATION": "INTERIOR: CONERIA CASTLE . SECOND FLOOR . SOUTH WING"},
		{"Guard 3": "Reports say that Garland holds the Princess in a Temple to the northwest."},
		{"LOCATION": "INTERIOR: CONERIA CASTLE . SECOND FLOOR . OUTSIDE KING'S THRONE ROOM"},
		{"ACTION": "The LIGHT WARRIORS head north passing through another hall of marble pillars. Before them is the King's room."},
		{"LOCATION": "INTERIOR: CONERIA CASTLE . SECOND FLOOR . KING'S THRONE ROOM"},
		{"ACTION": "Adorned with the finest ameneties and surrounded by dragons carved of pure gold the King's throne room sparkles with royalty. The King sits knowing that somehow someway Lukahn's prophecy is true yet is quite worried all the same. The party collectively advance to meet the King of Coneria."},
		{"King Of Coneria": "LIGHT WARRIORS.  Just as in Lukahn's prophecy. Garland has kidnapped the Princess. Please help her!!"},
		{"ACTION": "Hearing the King's plea of help to save his daughter, the LIGHT WARRIORS set out to rescue her from the evil Garland. But first they rest at the Conerian inn until morning. then set out on their long journey north."},
		{"LOCATION": "Chapter 2 - *The Rescue*"},
		{"LOCATION": "EXTERIOR: CONERIA"},
		{"ACTION": "Dawn. The four warriors. renewed by a night's rest and equipped wadaquate gear. begin their trek northward to the Temple of Fiends, where Garland holds the Princess."},
		{"LOCATION": "EXTERIOR: OVERWORLD . FOREST CLEARING . IN FRONT OF TEMPLE"},
		{"ACTION": "The LIGHT WARRIORS traversed through the treacherous Fiend Forest to the evil (and disheveled) Temple of Fiends. Garland awaits! The four UNwelcomed guests heedfully tread inside."},
		{"LOCATION": "INTERIOR: TEMPLE OF FIENDS . THRONE ROOM"},
		{"ACTION": "Boldly the LIGHT WARRIORS make their way inside and advance to the central room where the iniquitous Garland resides. Slowly they open the doors, only to meet their eyes: Garland surrounded by several bats? and perched upon his throne. Princess in tow."},
		{"ACTION": "BAT(S): Kee. Kee."},
		{"Garland": "No one touches my Princess!! LIGHT WARRIORS?? You impertinent fools. I, Garland, will knock you all down!!", "_Comment": "furious"},
		{"ACTION": "<BATTLE ensues>"},
		{"ACTION": "The LW defeat Garland with ease. hm. Maybe something more is behind this abduction? The true objective seems yet to be found."},
		{"Princess": "So, you are the LIGHT WARRIORS! Thank you.", "_Comment": "gratefully"},
		{"ACTION": "<scene is immediatly swept to the King's throne room at Coneria Castle>"},
		{"LOCATION": "INTERIOR: CONERIA CASTLE . SECOND FLOOR . KING'S THRONE ROOM"},
		{"ACTION": "After safely arriving back home the LIGHT WARRIORS return to see the King once again. This time with Princess Sara."},
		{"Princess": "This LUTE has been passed down from Queen to Princess for 2000 years, Garland stole it when he kidnapped me. Please accept it as my gift, it just might come in handy."},
		{"ACTION": "<you get the LUTE!>"},
		{"King": "Thank you for saving the Princess. To aid your quest I ordered a bridge built to the continent. Go now, and make the ORBS shine again!!"},
		{"Princess": "Now, get ready for your trip, and make the ORBS shine again."},
		{"King": "The Princess always worries about you."},
		{"COMMENT": "Note: These latter two dialogues are repeated throughout the course of the game."},
		{"LOCATION": "INTERIOR: CONERIA CASTLE . SECOND FLOOR . OUTSIDE KING'S ROOM"},
		{"LOCATION": "INTERIOR: CONERIA CASTLE . SECOND FLOOR . SOUTH WING"},
		{"LOCATION": "INTERIOR: CONERIA CASTLE . FIRST FLOOR . BENEATH FIRST FLOOR STAIRS"},
		{"ACTION": "Eager to check out the new bridge the LIGHT WARRIORS make their way down to the first floor."},
		{"Guard 4": "Yes Sir!! I belong to the Honor Guard of Castle Coneria.", "_Comment": "attentively"},
		{"LOCATION": "INTERIOR: CASTLE CONERIA . FIRST FLOOR . OUTSIDE QUEEN'S CHAMBERS"},
		{"LOCATION": "INTERIOR: CASTLE CONERIA . FIRST FLOOR . INSIDE QUEEN'S CHAMBERS"},
		{"Queen Jane": "Thank you for saving Princess Sara."},
		{"LOCATION": "INTERIOR: CASTLE CONERIA . FIRST FLOOR . CORRIDERSHALLS"},
		{"Scholar": "Legend says that the LUTE can break the evil gate."},
		{"LOCATION": "INTERIOR: CONERIA CASTLE . FIRST FLOOR . PRINCESS' SISTER'S QUARTERS"},
		{"Princess's Sister": "My sister is back safe! Thank you.", "_Comment": "overjoyed"},
		{"LOCATION": "INTERIOR: CONERIA CASTLE . FIRST FLOOR . NEAR ENTRANCE"},
		{"LOCATION": "EXTERIOR: OVERWORLD . NORTH BRIDGE"},
		{"ACTION": "Quite massive and expansive it will surely stand true for many years to come. Night befalls soon so the LWs head back into town for rest and to restock their much needed supplies in this dangerous world."},
		{"LOCATION": "EXTERIOR: CONERIA . OUTSIDE MAGIC CENTERS"},
		{"Old Woman": "North of Coneria lives a witch named Matoya."},
		{"LOCATION": "EXTERIOR: CONERIA . NEAR CLINIC"},
		{"Woman 2": "Matoya has poor eyesight. She needs the CRYSTAL to see."},
		{"LOCATION": "Chapter 3 - *Of Witches and Wind*"},
		{"COMMENT": "NOTE: This is merely a sidetrack or diversion from the true flow of the game but if you go back to the Temple of Fiends you can examine the ORB behind Garland and the captive Princess."},
		{"ACTION": "Inspection of the 'ORB' merits you this text.."},
		{"ACTION": "The black ORB glitters ominously.... But nothing happens."},
		{"LOCATION": "EXTERIOR: OVERWORLD . CROSSING NORTH BRIDGE (Closing of Prologue)"},
		{"ACTION": "And so their journey begins."},
		{"ACTION": "What awaits the Four, they do not know."},
		{"ACTION": "Each holding an ORB, that 2000 years ago shined with beauty from within. But now, only darkness."},
		{"ACTION": "Come!! Start your journey! Return the light of peace to our world."},
		{"ACTION": "PROGRAMMED BY N A S I R"},
		{"ACTION": "CHARACTER DESIGN"},
		{"ACTION": "YOSHITAKA AMANO"},
		{"ACTION": "SCENARIO BY"},
		{"ACTION": "KENJI TERADA"},
		{"ACTION": "PRODUCTION OF"},
		{"ACTION": "SQUARE A-TEAM"},
		{"LOCATION": ". . . . . . . . . . . . . TM&xa9 1990 xa9 1987 NINTENDO SQUARE"},
		{"LOCATION": "EXTERIOR: OVERWORLD . MATOYA'S CAVE"},
		{"ACTION": "Crossing the channel the LW embark into new territory. As they pass, they notice another port and traverse through a valley. Continuing north the party enters a large forest, although very dense our warriors manage to negotiate their way through. They spot a cave just outside the forest and for now..investigate."},
		{"LOCATION": "INTERIOR: MATOYA'S CAVE . OUTSIDE INNER ROOM"},
		{"Broom": ". TCELES B HSUP A magic spell?"},
		{"COMMENT": "(Push 'B' button and 'select' simultaneously to access the world map.)"},
		{"LOCATION": "INTERIOR: MATOYA'S CAVE . SANCTUM"},
		{"ACTION": "Creepy and full of skulls, Matoya's Cave certainly falls into the 'witch' category of interior design, ne?"},
		{"ACTION": "BROOM(S): . TCELES B HSUP A magic spell? (r)"},
		{"Matoya": "Where, is my CRYSTAL? I can't see anything without it.  Who stole my CRYSTAL?"},
		{"LOCATION": "EXTERIOR: OVERWORLD"},
		{"ACTION": "Knowledge gained; once again the LIGHT WARRIORS seek the unknown, this time eastward. Through deserts, swamps, and forests the party of four wages on.... to find a (normally) bustling port town named Pravoka."},
		{"LOCATION": "EXTERIOR: PRAVOKA"},
		{"ACTION": "A harbor town surrounded by water and brick, Pravoka is larger than Coneria and is more linear in design. Strangely absent are the citizens. Only 2 visible?"},
		{"LOCATION": "EXTERIOR: PRAVOKA . NEAR ENTRANCE"},
		{"Man 1": "Help!"},
		{"LOCATION": "EXTERIOR: PRAVOKA . CENTER OF TOWN"},
		{"ACTION": "DUDE wMOHAWK: This town has been invaded by pirates."},
		{"COMMENT": "(could this guy be related to General Leo??..nah)"},
		{"LOCATION": "EXTERIOR: PRAVOKA . WEST END OF TOWN"},
		{"Bikke": "Aye, I am Bikke the Pirate, and surprised I am that you scurvy dogs have the nerve to face me. Mates! Get those landlubbers!"},
		{"ACTION": "<BATTLE erupts, 9 pirates charge your party!>"},
		{"ACTION": "LW kick pirate butt."},
		{"Bikke": "Okay, you got me. Take my SHIP.", "_Comment": "humbly"},
		{"ACTION": "<townsfolk come out of hiding>"},
		{"Bikke": "I won't be any more bother. I promise."},
		{"LOCATION": "EXTERIOR: PRAVOKA . RESIDENTIAL AREA NORTH OF ITEM SHOP"},
		{"Man 2": "Thank you. We don't need to be afraid of pirates anymore."},
		{"Young Woman": "The Elves live across the sea. Matoya's HERB is the only thing that will wake their Prince."},
		{"LOCATION": "EXTERIOR: PRAVOKA . CENTER OF TOWN"},
		{"ACTION": "DUDE wMOHAWK: Ships can stop only at ports. There are no ports in the north."},
		{"Man 3": "There are many dangerous monsters in the sea. Be careful!"},
		{"LOCATION": "EXTERIOR: PRAVOKA . OUTSIDE OF WHITEMAGIC CENTER"},
		{"Old Man": "I have escaped from Melmond, in the west. My town is in trouble. Please help them!!"},
		{"LOCATION": "EXTERIOR: OVERWORLD . PRAVOKA HARBOR"},
		{"ACTION": "Just outside Pravoka the LIGHT WARRIORS gaze upon the massive billowing sails of their newly won ship. The LW take to the Aldi Sea in search of Elves..be it more, be it less. AHOY!"},
		{"COMMENT": ""},
		{"LOCATION": "- The Final Fantasy Script - Part II - A NEW FRONTIER"},
		{"LOCATION": "Chapter 4 - *King to the Key*"},
		{"COMMENT": "Note: Take this opportune moment to EXPLORE! Revist Coneria (albeit sans new dialogue) and see your world from wind in sail. Iiiiiiit's NOT a small world aaaaaaaaaaaaafter all! ~~ Play the \"#\" game if yer bored (press A&B together 55 times)."},
		{"LOCATION": "EXTERIOR: OVERWORLD . ELFLAND PORT"},
		{"ACTION": "Sailing due south the LW meet land once again. They trek even further south on foot to find a castle and town hidden within the forest. Elves!"},
		{"LOCATION": "EXTERIOR: ELFLAND"},
		{"ACTION": "A quaint village heavily laden wbushes and trees making navigation through the town like a maze. Nevertheless, it's still a homey town nestled in the forest. Being the largest town, so far, Elfland has a definite organic prescence. derived probably from elves' stong ties with nature."},
		{"LOCATION": "EXTERIOR: ELFLAND . NEAR ENTRANCE"},
		{"Elf": "Save our Prince!"},
		{"LOCATION": "EXTERIOR: ELFLAND . OUTSIDE ARMORY"},
		{"Elf": "The Prince must wake soon, or the Dark Elf will dominate!"},
		{"LOCATION": "EXTERIOR: ELFLAND . NEAR ITEM SHOP"},
		{"Elf": "The Prince must wake soon, or the power of the Dark Elf will dominate."},
		{"LOCATION": "EXTERIOR: ELFLAND . OUTSIDE BLACK MAGIC CENTER"},
		{"LOCATION": "EXTERIOR: ELFLAND . OUTSIDE FIRST WHITE MAGIC CENTER"},
		{"Elf": "Swords and armors made of Silver are very powerful."},
		{"LOCATION": "EXTERIOR: ELFLAND . WOODED PATH"},
		{"Elf": "Long ago I wandered to the Northwest. I found an ancient castle that was so spooky, I left immediately."},
		{"LOCATION": "EXTERIOR: ELFLAND . NORTHERN CLEARING"},
		{"Elf": "Our Prince was to become the King of Elfland."},
		{"LOCATION": "EXTERIOR: ELFLAND . GRAVEYARD"},
		{"ACTION": "The LWs pause to pay thier respects to heros of the past."},
		{"COMMENT": "Note: Inspection of 'Erdrick's Tombstone' merits you this text.."},
		{"ACTION": "Here lies Erdrick 837 - 866 R.I.P"},
		{"ACTION": "Note: Inspection of a 'tomb' merits you this text.."},
		{"ACTION": "This is a tomb."},
		{"COMMENT": "(FTR the population of ElfLand is 24, including shops&services.)"},
		{"LOCATION": "EXTERIOR: CASTLE OF ELF"},
		{"ACTION": "Finally, maybe the party will find some answers to this ongoing conundrum within the walls of the Elf Castle. The LIGHT WARRIORS enter.."},
		{"LOCATION": "INTERIOR: CASTLE OF ELF"},
		{"ACTION": "Past a ring of great pillars a duo of elf guards greet the party and inform them of the dilemma of the Kingdom; the Prince CAN'T WAKE UP!"},
		{"ACTION": "ELF GUARD(S): Astos put the Prince to sleep. Please! Save him!"},
		{"LOCATION": "INTERIOR: CASTLE OF ELF . PRINCE'S CHAMBERS"},
		{"ACTION": "Flanked by two massive pillars the door to the Prince's Chambers is unguarded, yet still has regal impressions all it's own. Inside are decorations of elf culture and golden dragons forged of gold (royalty luv their gold dragons, eh?). In the center is a bed currently occupied by the sleeping Prince."},
		{"Elf Prince": "z. z.", "_Comment": "deep asleep"},
		{"Attendant": "For five years the Prince has slept under Astos' spell. Only HERB can wake him!", "_Comment": "worryingly"},
		{"LOCATION": "EXTERIOR: CASTLE GROUNDS"},
		{"ACTION": "Tending the castle gardens, the groundskeeper verily provides some advice for our heros."},
		{"Grounds Keeper": "It is said there is a witch who has HERBS. I believe that her name is.  Matoya!"},
		{"LOCATION": "INTERIOR: CASTLE OF ELF . NORTHWEST JUNCTURE"},
		{"Elf": "The Cave of Dwarf is at the west end of the Aldi sea."},
		{"LOCATION": "INTERIOR: CASTLE OF ELF . HALL"},
		{"Elf": "Without warning, Astos attacked our castle. Our Prince was laid under a curse, and our treasury ransacked."},
		{"LOCATION": "EXTERIOR: CASTLE OF ELF . TREASURY"},
		{"ACTION": "Half-hidden and guarded the Treasury resides outside of the castle itself. Yet another entrance sealed by the elusive mystic KEY. ACK!"},
		{"LOCATION": "EXTERIOR: OVERWORLD . COUNTRYSIDE NEAR ELFLAND"},
		{"ACTION": "After exploring the Castle of Elf, the LIGHT WARRIORS commiserate and decide to earn some gold. for the supplies in ElfLand do not come cheap. The surrounding forest and especially fields provide quite the adequate hunting-ground for many different types of gold- bearing ruffians. specifically, Ogres. ... Purchasing the necessary up- grades in weapons, armor, magic, and such the LW now hear fate beckoning them to the northwest."},
		{"LOCATION": "EXTERIOR: OVERWORLD . ALDI SEA"},
		{"ACTION": "The LIGHT WARRIORS back on the vast and dangerous sea. this time venture northwest toward the Dwarf Cave. In search of some sort of link to the endless clues that they have been collecting on their quest to RElight the four ORBS. Determination and honor abound as the LW press onward against all odds."},
		{"LOCATION": "EXTERIOR: ALDI SEA . NORTHWEST PORT"},
		{"ACTION": "Land ho! The LW meet 'terra firma' oncemore and port their ship respectively. On land the group travels southwest through a forest and locates the opening of a great cave in the rockface. Slowly the LW trod inside."},
		{"LOCATION": "INTERIOR: DWARF CAVE"},
		{"ACTION": "The LIGHT WARRIORS meet several (busy) dwarves going about their business in the torch-lit cave. It seems a strange place to live.. but the dwarves find it quite comfortable here indeed."},
		{"LOCATION": "INTERIOR: DWARF CAVE . NEAR ENTRANCE"},
		{"Dwarf": "Hurray!!"},
		{"LOCATION": "INTERIOR: DWARF CAVE . OBTRUDING ROOM SOUTHWEST OF ENTRANCE"},
		{"Dwarf": "Dwarves can see in the dark!"},
		{"LOCATION": "INTERIOR: DWARF CAVE . ROOM NORTH OF ENTRANCE"},
		{"ACTION": "A dwarf sits bestowicly on a wooden chair."},
		{"Dwarf": "Hurray!!"},
		{"LOCATION": "INTERIOR: DWARF CAVE . VICINITY AROUND ROOMS"},
		{"Dwarf": "I'm looking for the FLOATER. I'll bet with it I could float anything."},
		{"Dwarf": "That sound? Nerrick is digging a canal."},
		{"Dwarf": "The {*}.  bracelet can protect you, like armor."},
		{"LOCATION": "INTERIOR: DWARF CAVE . OUTSIDE SMITH'S ROOM"},
		{"Dwarf": "With the CRYSTAL, even the blind can see. Astos stole it from Matoya."},
		{"Dwarf": "Did you meet Smith, our blacksmith?"},
		{"Dwarf": "The earth is rotting slowly from the west."},
		{"LOCATION": "INTERIOR: DWARF CAVE . INSIDE SMITH'S WORKPLACE"},
		{"Smith": "For the LIGHT WARRIORS I will make a truly legendary sword. However, my supply of ADAMANT is exhausted."},
		{"COMMENT": "Note: Inspection of a 'sword' merits you this text.."},
		{"ACTION": "No! That is just an unusable sample."},
		{"LOCATION": "INTERIOR: DWARF CAVE . PATH LEADING SOUTH"},
		{"Dwarf": "That sound? Nerrick is digging a canal."},
		{"LOCATION": "INTERIOR: DWARF CAVE . CANAL PROJECT"},
		{"Nerrick": "A rock blocks construction of my canal. If I only had TNT."},
		{"LOCATION": "EXTERIOR: OVERWORLD"},
		{"ACTION": "Gaining newfound knowledge from the dwarves the LIGHT WARRIORS now strive for the mystic KEY. The hunt has now truly begun!"},
		{"LOCATION": "EXTERIOR: OVERWORLD . ELFLAND"},
		{"ACTION": "Once again the LWs head back to ElfLand. They rest and replenish their supplies. Their next target. Northwest Castle."},
		{"LOCATION": "EXTERIOR: OVERWORLD . OUTSIDE NORTHWEST CASTLE"},
		{"ACTION": "After a days journey north through denizens of the forest the LIGHT WARRIORS happen upon an ancient castle which has 'spooky' written all over it."},
		{"LOCATION": "INTERIOR: NORTHWEST CASTLE"},
		{"ACTION": "Strangely only a few bats inhabit the castle..has it been deserted??"},
		{"ACTION": "BAT(S): Kee. Kee. (r)"},
		{"LOCATION": "INTERIOR: NORTHWEST CASTLE . KING'S THRONE ROOM"},
		{"ACTION": "Adorning the King's throne are 8 golden dragaons arranged in a pattern to almost intimidate visitors. The LW approach the lone King with investigative suspicion."},
		{"King": "Astos double-crossed us. Go south, to the cave of Marsh, to retrieve the CROWN. Then, bring it directly back to me!"},
		{"LOCATION": "EXTERIOR: OVERWORLD"},
		{"ACTION": "Heeding the King's demand the LWs head in the opposite direction in which they came for Marsh Cave in pursuit of a CROWN. The marshy swamp proves dangerous with much more enemies. Fearlessly our party carrys on with the search and locates the Marsh Cave."},
		{"LOCATION": "INTERIOR: MARSH CAVE"},
		{"ACTION": "Deeper and deeper the LW plunge themeselves to lower levels of the cave. The farther they get..the more evil radiates."},
		{"ACTION": "BAT(S): Kee. Kee. (r)"},
		{"LOCATION": "INTERIOR: MARSH CAVE . THIRD FLOOR . ROOM"},
		{"ACTION": "The LW enter a room with 7 gargoyles surrounding a chest. When they approach it a furtive band of wizards, keepers of the CROWN, bargain for a fight with the LIGHT WARRIORS. After a semi-tough battle(depending on your level building) the LW win and open the treasure chest; only to find..the CROWN!"},
		{"LOCATION": "EXTERIOR: OVERWORLD"},
		{"ACTION": "Over the river and through the woods to Astos's house we go..."},
		{"LOCATION": "INTERIOR: NORTHWEST CASTLE . KING'S THRONE ROOM"},
		{"ACTION": "The LIGHT WARRIORS approach the King and plan to graciously hand over the hard-earned CROWN to the King with pride. One problem. the King=Astos in disguise."},
		{"Astos": "HA, HA, HA! I am Astos, King of the Dark Elves. I have Matoya's CRYSTAL, and you shall give me that CROWN, now!!!"},
		{"ACTION": "<BATTLE ensues>"},
		{"ACTION": "And so, the LWs defeat the King of the Dark Elves, Astos. Each passing day the LIGHT WARRIORS fulfill more and more of the prophecy foretold by Lukahn. With the CRYSTAL now in their possession the party heads north to meet an old friend again."},
		{"COMMENT": "Note: BE KING FOR A DAY! Move your Light Warrior onto the King's throne and press start. Then exit the sub-screen by pressing 'B'. When you come out you'll be sitting on the throne facing forward. Kewl. ;)"},
		{"LOCATION": "INTERIOR: MATOYA'S CAVE . MAYTOYA'S ROOM"},
		{"ACTION": "Journeying back to Maytoya's Cave, the LWs find their way here much easier."},
		{"Matoya": "The Prince needs HERB? I'll trade the most powerful HERB to get my CRYSTAL back.  Oh! I can see!!"},
		{"Matoya": "You have no more business here. Go!!"},
		{"COMMENT": "Note: The latter dialogue spoken by Matoya is repeated throughout the course of the game. Meaning; your wasting your time to come back and see if she has something more consequential."},
		{"LOCATION": "EXTERIOR: OVERWORLD . PORT"},
		{"ACTION": "Rushing to get the HERB to the Prince of ElfLand the LWs set sail and navigate the sea. ~"},
		{"LOCATION": "EXTERIOR: CASTLE OF ELF . CASTLE GROUNDS"},
		{"Grounds Keeper": "Is that it? The HERB to save the Prince?"},
		{"LOCATION": "INTERIOR: CASTLE OF ELF . PRINCE'S CHAMBERS"},
		{"Attendant": "Oh, this HERB will release the Prince from Astos' curse. Look! He is waking."},
		{"Prince": "Is this a dream?.  Are you, the LIGHT WARRIORS?.  So, as legend says, I give you the mystic KEY."},
		{"ACTION": "<FINALLY, you get the mystic KEY!>"},
		{"Attendant": "Thank you. Peace will return to ElfLand."},
		{"Prince": "I feel fine now. Thank you."},
		{"LOCATION": "INTERIOR: CASTLE OF ELF . PASSAGE HALL"},
		{"ACTION": "GUARD1: The Prince keeps the mystic KEY until the coming of the LIGHT WARRIORS."},
		{"ACTION": "GUARD2: Maybe it's only rumor, but, I think the cause of all problems is to be found in the Cave of Marsh."},
		{"LOCATION": "INTERIOR: CASTLE OF ELF . EASTERN HALL"},
		{"Elf": "The Prince is awake! Thank you so much."},
		{"ACTION": "The LW explore talk to the citizens."},
		{"LOCATION": "EXTERIOR: ELFLAND . STREETS NEAR INN"},
		{"LOCATION": "EXTERIOR: ELFLAND . OUTSIDE ITEM SHOP"},
		{"Elf": "Legend says an AIRSHIP is buried somewhere."},
		{"LOCATION": "EXTERIOR: ELFLAND . WOODED PATH"},
		{"Elf": "Astos has been defeated? Peace will now return to ElfLand."},
		{"LOCATION": "EXTERIOR: ELFLAND . NEAR STREAM WALKWAY"},
		{"LOCATION": "EXTERIOR: ELFLAND . OPEN FIELD"},
		{"LOCATION": "EXTERIOR: CASTLE OF ELF . TREASURY"},
		{"ACTION": "The mystic KEY in hand the LIGHT WARRIORS must now retrack their steps and locate all the locked doors they have encountered thus far. Hence, we go back to Coneria where it all began. However, before that, the LWs nab the contents of the Castle of Elf's treasury and the concealed goods of the mysterious room in Astos's Castle."},
		{"LOCATION": "EXTERIOR: OVERWORLD . ELF PORT"},
		{"ACTION": "The LW have gained some new-found armor and goods and now head home? to Coneria."},
		{"LOCATION": "INTERIOR: CASTLE CONERIA . NEAR TREASURY"},
		{"Old Man": "Use that KEY. Inside what you find will be quite helpful."},
		{"LOCATION": "INTERIOR: CASTLE CONERIA . INSIDE TREASURY"},
		{"ACTION": "Musty and full of cobwebs the treasury hasn't been seen or touched by a living soul in over 400 years. The LW creek open the six chests, one by one, and find ... TNT!! How nifty."},
		{"LOCATION": "EXTERIOR: OVERWORLD . CONERIAN PORT"},
		{"ACTION": "And so, they head off to the Dwarf Cave to help Nerrick on his quest of constuction.. hoping to get one step closer in reilluminating the ORBS."},
		{"LOCATION": "INTERIOR: DWARVES CAVE . NERRICK'S DIG"},
		{"ACTION": "Arriving wTNT in tow the LWs head straight for Nerrick and his ongoing project to build a canal."},
		{"Nerrick": "Oh, wonderful! Nice work! Yes, yes indeed, this TNT is just what I need to finish my canal. Now excuse me while I get to work!"},
		{"ACTION": "<POOF! Nerrick disappears>"},
		{"ACTION": "Alas, the Western Sea is accessable to the LW courtesy of Nerrick's canal! Now they can truly sail the seas."},
		{"LOCATION": "Chapter 5 - *Trial by Earth*"},
		{"LOCATION": "EXTERIOR: OVERWORLD . NEWLY FORMED CANAL"},
		{"ACTION": "Wind in sail,the LIGHT WARRIORS pass through the canal and spot a port alongside a nearby town. They dock and explore it."},
		{"LOCATION": "EXTERIOR: MELMOND"},
		{"ACTION": "Disembarking their now trusted ship, the LW approach this new town with much curiosity. Why build a town in the close vicinity of so much swampland?? What lies ahead in this town? The LIGHT WARRIORS must seek it out..."},
		{"ACTION": "The LW advance into town and notice this town is very much unlike others. It appears to be in a state of decay. Much of the grass has withered, and only dead earth remains. unsuitable for living organisms. Also quite noticible are the graveyard areas sprinkled here and there; providing evidence of a dying society. Something is definitly not right here!"},
		{"LOCATION": "EXTERIOR: MELMOND . NEAR INN"},
		{"Man 4": "This town was invaded by the Vampire. The Clinic was destroyed and the town was cursed."},
		{"LOCATION": "EXTERIOR: MELMOND . OUTSIDE ARMORY"},
		{"Man 5": "The Vampire of the Earth Cave is stealing the Power of the Earth. We need your help."},
		{"Old Man": "The Earth Cave is on the peninsula southwest of this town."},
		{"Man 6": "The Titan who lives in the tunnel eats gems. He loves RUBIES."},
		{"LOCATION": "EXTERIOR: MELMOND . NORTHEAST GRAVEYARD"},
		{"Dr. Unne": "Everybody knows me. What!? You've never heard of Dr. Unne?"},
		{"LOCATION": "EXTERIOR: MELMOND . OUTSIDE WEAPON SHOP"},
		{"Woman 3": "WARRIORS. Revive the Power of the ORBS !"},
		{"LOCATION": "EXTERIOR: MELMOND . FIELD SOUTH OF DESTROYED CLINIC"},
		{"Man 7": "I'm a farmer."},
		{"Old Man": "Pass through the Titan's Tunnel, then south to find Sarda, the Sage."},
		{"Dwarf": "I am Jim. My home is the Dwarf Village, but I am here investigating."},
		{"LOCATION": "EXTERIOR: MELMOND . OUTSIDE DESTROYED CLINIC"},
		{"Man 8": "In the northern world, there once was a prosperous civilization, but now it is ruins."},
		{"Man 9": "They say the ancient people used a stone to make their ship float."},
		{"LOCATION": "EXTERIOR: MELMOND . NEAR BLACKMAGIC CENTER"},
		{"Man 10": "If the ORB of Earth begins to shine again, the earth shall revive."},
		{"Woman 4": "Sarda does not fear the evils of the cave."},
		{"LOCATION": "EXTERIOR: MELMOND . FRONT OF WHITE MAGIC CENTER"},
		{"Man 11": "WARRIORS. Revive the Power of the ORBS !"},
		{"COMMENT": "(FTR: Population of Melmond is 19, including citizens of the shops&services.)"},
		{"LOCATION": "EXTERIOR: OVERWORLD"},
		{"ACTION": "Having gathered new clues to the reasons for all the destruction of this land from the townsfolk, the LW plan their next course of action. They rest up at the inn and re-stock their supplies and head west on foot in search of this mysteriously conniving vampire. Perhaps they can reason with him...if not; the LWs will be prepared. Resolute, the LIGHT WARRIORS push forever on.."},
		{"LOCATION": "EXTERIOR: OVERWORLD . MOUTH OF CAVE"},
		{"ACTION": "After a days worth of travel. in the direction of setting sun. through torturous swamps and unforgiving forests the LW manage to find an entrance to a cave. Something."},
		{"LOCATION": "INTERIOR: TITAN'S TUNNEL"},
		{"ACTION": "Dark and foreboding, here is where the LIGHT WARRIORS bid for passage. However, a rather adamant (and large) beast(of the variety that could snap yer neck, squeeze your guts out, grind you into a bloody pulp, and fix himself a microwave dinner while doing it) prevents that."},
		{"Titan": "No one passes this road."},
		{"COMMENT": "(oooooooookay. Let's just turn 'round, and act like we never came here.)"},
		{"LOCATION": "EXTERIOR: OVERWORLD . ENTRANCE TO EARTH CAVE"},
		{"ACTION": "Their search leads them to yet another cave, one where many trials reside. The LW descend it's depths with composure facing the great unknown."},
		{"LOCATION": "INTERIOR: EARTH CAVE . SECOND FLOOR"},
		{"ACTION": "Bats, why does it have to be bats!? LOTS OF BATS on the second floor and yup, you guessed it. all of them remitt the same darn phrase: \"Kee. Kee. \""},
		{"LOCATION": "INTERIOR: EARTH CAVE . THIRD FLOOR"},
		{"ACTION": "Below the depths , an evil stirs, waiting.. waiting for the LIGHT WARRIORS. His name is merely Vampire. If the LIGHT WARRIORS want possession of the RUBY he must be defeated, or so it's heard. Defiantly the vampire stands....."},
		{"Vampire": "All living things were born to die. No one can defeat me, the Vampire!!"},
		{"LOCATION": "EXTERIOR: OVERWORLD"},
		{"ACTION": "Upon defeat of the unduly confident Vampire the LW discover that he indeed held the RUBY in a chest. They decide to return to the real world again and head outside. Just maybe a Titan can be bribed....?"},
		{"LOCATION": "INTERIOR: TITAN'S TUNNEL"},
		{"ACTION": "Hey, there big guy. Looky here! The LWs put their newly-won RUBY on display for the monster. It looks as though he'll be sold out. HOOWOO!"},
		{"ACTION": "If you want pass, give me the RUBY. Crunch, crunch, crunch, mmm, it tastes so sweet. Rubies are my favorite."},
		{"ACTION": "<WHOOSH! he vanishes - natch>"},
		{"LOCATION": "EXTERIOR: OVERWORLD"},
		{"ACTION": "Emerging from the opposite end of the cave the LW come out to find more unexplored territory. Perhaps this is where the old sage Sarda lives? Indeed. A new cave holds his residence."},
		{"LOCATION": "INTERIOR: SARDA'S CAVE"},
		{"ACTION": "Homely built and stocked for bear wmany exotic herbs and potions. Sarda's humble abode is quaint, at best, if not lonesome. A true thinking man's way of life."},
		{"Sarda": "Use this ROD behind the Vampire's room. Hiding deep inside you will find the cause of the earth's rot."},
		{"ACTION": "WARRIORS. Revive the Power of the ORBS !"},
		{"LOCATION": "EXTERIOR: OVERWORLD"},
		{"ACTION": "With the ROD acquired the LW once again head back to Earth Cave to face the cause of this rotting. A vile cause.."},
		{"LOCATION": "INTERIOR: EARTH CAVE . THIRD FLOOR . BEHIND VAMPIRE'S ROOM"},
		{"ACTION": "Inspecting the space behind the vampires room the LW notice a massive stone plate. sealing their fate, literally. The ROD obtained from Sarda is the answer."},
		{"LOCATION": ". Note: Inspection of the 'plate' merits you this text."},
		{"ACTION": "There is a stone plate on the floor. You sense something. Evil?. ."},
		{"ACTION": "Pulling out the ROD, the LIGHT WARRIORS feel the power reverberating throughout the room. Then, slowly touch the plate, shattering it into a million pieces. A stairway is revealed!"},
		{"LOCATION": "INTERIOR: EARTH CAVE . FIFTH FLOOR . EARTH FIENDS' ORB ROOM"},
		{"ACTION": "Inauspiciously, the LW stubble upon the fiend's orb. Stalagmites and stalagtites surround and encompass the room. elliciting a mood of fear .. which even the LIGHT WARRIORS feel to a certain degree."},
		{"ACTION": "The FIEND's ball cracks open. An ominous cloud rises, and an evil shape congeals. It is LICH, the fiend of Earth."},
		{"ACTION": "<BATTLE ensues>"},
		{"ACTION": "The LW are victorious! The Earth Fiend, Lich, is defeated. The LIGHT WARRIORS step through a magical field and a GREAT power is released. The Earth ORB has been given it's power back and the reviving process has begun. The Earth ORB is once again shining!"},
		{"LOCATION": "EXTERIOR: MELMOND . OUTSIDE INN"},
		{"Man 12": "Are you the LIGHT WARRIORS?"},
		{"LOCATION": "EXTERIOR: MELMOND . OUTSIDE ARMORY"},
		{"Man 13": "Melmond was once a beautiful town."},
		{"Old Man": "Look! The Earth ORB is shining again."},
		{"LOCATION": "EXTERIOR: MELMOND . NEAR DESTROYED CLINIC"},
		{"Jim The Dwarf": "LIGHT WARRIORS.  Thanks to you, the earth is beginning to revive."},
		{"ACTION": "After a well-earned rest the LIGHT WARRIORS quest is directed east to Crescent Lake. There they can speak with Lukahn the great prophet and, perhaps, gain some wisdom on their future."},
		{"COMMENT": ""},
		{"LOCATION": "- The Final Fantasy Script - Part III - WORLD REBIRTH"},
		{"LOCATION": "Chapter 6 - *Virtue of the Fallen*"},
		{"LOCATION": "EXTERIOR: OVERWORLD . SEA"},
		{"ACTION": "To get to Crescent Lake the LW must traverse much open sea. The journey will be a long one. so the LW, wisely, head back to Coneria to stock upon some supplies before departing."},
		{"LOCATION": "EXTERIOR: OVERWORLD . FAR SOUTHEAST PORT OF LOWER CONTINENT"},
		{"ACTION": "The LIGHT WARRIORS reach their destination after many days at sea. The trek was long and arduous but the party's resiliancy presided over the trials. Eager to set foot on land, the LW dock and head-out for Crescent Lake. Through a dense forest a quaint (albeit genteel) town resides on a peculiar shaped lake ... one shaped in the likeness of a crescent moon."},
		{"LOCATION": "EXTERIOR: CRESCENT LAKE . OUTSIDE MAGIC CENTERS"},
		{"Woman 5": "LIGHT WARRIORS, you can do it!"},
		{"LOCATION": "EXTERIOR: CRESCENT LAKE . BEHIND WEAPON SHOP"},
		{"Man 14": "z.  z.", "_Comment": "s, he's asleep"},
		{"LOCATION": "EXTERIOR: CRESCENT LAKE . SECLUDED GROVE NEAR TOWN"},
		{"ACTION": "Locating a hidden path behind the magic centers the LW hapen upon none other than the Circle of Sages. Lukahn at last!"},
		{"Sage": "We, the Twelve Sages, were lead here by the stars and prophecy."},
		{"Sage": "Once the ORBS shined with the power of Earth, Wind, Fire, and Water. The four FIENDS seized those Powers."},
		{"Sage": "Earth, Wind, Fire, and Water.  The world is bound by these four Powers."},
		{"Sage": "Each element's power focuses at its Altar. Locate, and crush the Fiend. Then to make it shine, place the ORB on the Altar it guarded!"},
		{"Sage": "Four FIENDS are bent on the world's destruction. 200 years ago, the FIEND of Wind teamed with that of the Water to destroy civilization."},
		{"Sage": "The Earth FIEND causes the rot of our land."},
		{"Sage": "The Fire FIEND will burn everything up!"},
		{"Sage": "As you restore light to the ORBS, we will reveal more secrets, please see us repeatedly."},
		{"Sage": "LIGHT WARRIORS, only you can make the ORBS shine again!!"},
		{"Sage": "Quickly, before all is burnt, hurry to Gurgu Volcano and stop the FIEND of Fire."},
		{"Sage": "Great job vanquishing the Earth FIEND. Now, the Fire FIEND wakes. With this CANOE go to the VOLCANO, and defeat that FIEND also!"},
		{"ACTION": "<you receive the CANOE!;>"},
		{"ACTION": "And finally, the LIGHT WARRIORS meet the 12th Sage: Lukahn."},
		{"Lukahn": "I am Lukahn. Now all legends and prophecy will be fulfilled. Our path has been decided."},
		{"LOCATION": "EXTERIOR: OVERWORLD . CRESCENT LAKE RIVER"},
		{"ACTION": "Gurgu Volcano. There they will face their next challenge. The FIEND of Fire! Prepared, the LW pack everything into the canoe and head northwest; up the river."},
		{"LOCATION": "EXTERIOR: OVERWORLD . GURGU VOLCANO"},
		{"ACTION": "Perched high atop an island, Gurgu Volcano seems to be a timeless relic, one capable of great feats. Yet harboring such evil. the LW must be ever vigilant for the FIEND of Fire is not as forgiving as Lich had been. Destiny beckons them down into the fiery belly of the Earth."},
		{"LOCATION": "INTERIOR: GURGU VOLCANO . FIRE ORBS' ALTAR ROOM"},
		{"ACTION": "After winding their way down the searing hot depths of Gurgu Volcano, the LW discover the lair of the evil FIEND of Fire. The battle for the element of Fire is here. nary a coward in the LW's, they stand true against the febrile and ever-pyretic Kary."},
		{"Kary": "Is it you, the tinder that defeated the FIEND of the Earth, and distrurbed my sleep? I, KARY, will now show you the force of Fire, and you shall burn in its flames!!"},
		{"COMMENT": "(she sure is \"torchy\", ne?)"},
		{"ACTION": "A resounding battle with Kary took it's toll on the LW's resolve but eventually through might&magic they overcame the FIEND's ravenous spells of flame. Intrepid as they are; the LW step forward and renew the lost power of the ORB of Fire. A resurgence of committment is felt by the LIGHT WARRIORS. for they have restored half of the ORBS! Still, a long road lies ahead and many perils tread with them ..."},
		{"LOCATION": "EXTERIOR: CRESCENT LAKE . BEHIND WEAPON SHOP"},
		{"Man 15": "For ten years I probed for the FLOATER. CANOE north, to the Ice Cave."},
		{"LOCATION": "EXTERIOR: CRESCENT LAKE . SECLUDED GROVE (CIRCLE OF SAGES)"},
		{"Sage": "We must use force only for just purposes."},
		{"Sage Before Lukahn": "400 years ago, we lost control of the Wind. 200 years later we lost the Water, then Earth and Fire followed. The Powers that bind this world are gone."},
		{"LOCATION": "EXTERIOR: ELFLAND . OUTSIDE ARMORY"},
		{"Elf": "In the desert south of the crescent, something is emerging from below the sand.  Use the FLOATER!"},
		{"LOCATION": "EXTERIOR: ELFLAND . CLOSE PROXIMITY OF BLACK MAGIC CENTER"},
		{"Elf": "I can see a cave above the crescent.  To the north of the volcano, there you will find the FLOATER."},
		{"LOCATION": "INTERIOR: DWARF CAVE . NEAR ENTRANCE"},
		{"Dwarf": "Oh, did you see that canal? Old Nerrick truly is great indeed."},
		{"Dwarf": "Old Nerrick is a very respectable Dwarf."},
		{"Dwarf": "The earth is reviving! Thanks to you, LIGHT WARRIORS!"},
		{"LOCATION": "EXTERIOR: OVERWORLD . CRESCENT LAKE PORT"},
		{"ACTION": "The LIGHT WARRIORS with all the hints of knowledge gained from the Circle of the Sages and townsfolk of Crescent Lake, begin their search for the mysterious relic of the past which can defy the laws of gravity and powerful enough to suspend entire castles. the FLOATER."},
		{"LOCATION": "EXTERIOR: OVERWORLD . RYUKAHN DESERT . AIRSHIP GRAVE"},
		{"ACTION": "Having obtained the ancient FLOATER stone from the frigid Ice Cave, the LW head south to the Ryukahn Desert. Maybe ... somewhere exists a wonder that people used to roam high above the clouds with called an Airship. After a days worth of traveling in the scorching sun-baked dunes, the LW almost given up hope..but then something happens. The FLOATER stone eerily glows an strange aura over a portion of the land. The LW hold it tight as they witness an ancient legacy unfold before their eyes. The AIRSHIP rises from it's 400 year-old grave and magnificantly hovers before the LIGHT WARRIORS. ready to aide and assist them on their quest to save the world."},
		{"LOCATION": "Chapter 7 - *Coming of Age*"},
		{"LOCATION": "EXTERIOR: OVERWORLD"},
		{"ACTION": "In the Airship the LIGHT WARRIORS head to uncharted territory, their quest has taken so many twists and turns . what now? No one knows for sure but the LW face their quest for light with an undying courage.. courage."},
		{"LOCATION": "EXTERIOR: OVERWORLD . CARDIA ISLANDS"},
		{"ACTION": "The LW land their Airship on a chain of islands that bears many 'cave entrances' if you will. Perhaps inhabitants make an abode from these. Mystery abounds!"},
		{"LOCATION": "INTERIOR: CARDIA ISLANDS . FIRST CAVE . NEAR ENTRANCE"},
		{"Dragon": "Only the courageous ones bring back the proof of their courage."},
		{"LOCATION": "INTERIOR: CARDIA ISLANDS . SECOND CAVE . NEAR ENTRANCE"},
		{"Dragon": "We are going to the Castle of Ordeal to the northeast. There we will test, and bring back proof of our courage."},
		{"LOCATION": "INTERIOR: CARDIA ISLANDS . SECOND CAVE . INSIDE ROOM"},
		{"Dragon": "The proof of your courage might be anything."},
		{"Dragon": "Once in the north, there were beautiful palaces and big mechanical castles."},
		{"LOCATION": "INTERIOR: CARDIA ISLANDS . THIRD CAVE . ENTRANCE HALL"},
		{"Dragon": "If you are brave enough try meeting the King of the Dragons, BAHAMUT."},
		{"LOCATION": "INTERIOR: CARDIA ISLANDS . THIRD CAVE . EASTERN JUNCTURE"},
		{"Dragon": "Unprofitable business is not a practice of the Dragons of Cardia."},
		{"Dragon": "Long ago, Dragons and humans lived and traded together."},
		{"LOCATION": "INTERIOR: CARDIA ISLANDS . FIFTH CAVE . NEXT TO ENTRANCE"},
		{"Dragon": "Have you met BAHAMUT, the Dragon King? He honors those with courage as true warriors."},
		{"LOCATION": "INTERIOR: CARDIA ISLANDS . SIXTH CAVE . SECOND ROOM"},
		{"ACTION": "Room is filled with old chests and wares. Simple yet strangely 'neat' for dragons. Oh well..."},
		{"Dragon": "You are not afraid of me?? Then, I am impressed!"},
		{"LOCATION": "INTERIOR: CARDIA ISLANDS . BAHAMUT'S CAVE . BAHAMUT'S CHAMBERS"},
		{"ACTION": "Descending a long, silent hall the LIGHT WARRIORS uncertainly seek out Bahamut's whereabouts. The party enters a room filled with seemingly meticulously placed candles. ((Notice the shape they form?))"},
		{"Guard Dragon": "This is BAHAMUT's room."},
		{"Guard Dragon": "BAHAMUT verifies the true courage of all."},
		{"Bahamut": "I am BAHAMUT, King of the Dragons. Bring me proof of your courage, to receive the honor due true warriors."},
		{"LOCATION": "EXTERIOR: CASTLE OF ORDEAL Heeding Bahamut's will, the LIGHT WARRIORS advance toward the intriguing Castle of Ordeal. What awaits inside? A test ... ?"},
		{"LOCATION": "INTERIOR: CASTLE OF ORDEAL . CENTER OF PILLARS"},
		{"Old Sage": "Possession of the CROWN is required to test your courage. Take it to the royal throne, and bring back proof of your courage. GOOD LUCK!"},
		{"ACTION": "<POOF! he disappears>"},
		{"LOCATION": "INTERIOR: CASTLE OF ORDEAL . THRONE ROOM"},
		{"ACTION": "The LW place the CROWN on the throne and are magically whisked away into a cramped-up room..and outside it lies a maze to test their wits as well as their physical strength."},
		{"ACTION": "After a long battle to the top the prize ended up being a rat's TAIL!!!!!!?????? WTH!? Let's go see BAHAMUT shall we?"},
		{"COMMENT": "(Note: if you forgot to do it before, check out the text for the \"TAIL\". Final Fantasy humor in it's infancy, huh?)"},
		{"LOCATION": "INTERIOR: BAHAMUT'S CAVE . BAHAMUT'S CHAMBERS"},
		{"COMMENT": "(glorifyed, obviously - hungry too, perhaps? LOL)"},
		{"Bahamut": "The TAIL of a rat proves your courage. I shall give you the honor due true warriors."},
		{"ACTION": "<WHOOOOSH!! Whoa! We just got a LOT more powerful and kewler lookin'! Thanx, O'fiery-breathed one!>"},
		{"ACTION": "Bahamut has bestowed a great power on the LIGHT WARRIORS and they each now know their true-self. The party is now prepared for the conflicts ahead of them and to face them with courage."},
		{"Bahamut": "WARRIORS. Revive the Power of the ORBS!"},
		{"COMMENT": "((Note: the latter these two dialogues spoken by BAHAMUT is standard issue for integral characters (after they have accomplished their main reason for \"being\" in the game). So, if you come back and visit them again. that is all yer gonna get.. trust me! ;) To employ an aphorism: \"It's sad but true.\"))"},
		{"LOCATION": "Chapter 8 - *The Mermaid's Tale*"},
		{"LOCATION": "EXTERIOR: OVERWORLD"},
		{"ACTION": "Now the LIGHT WARRIORS turn their focus west to the town on the coastline. Perhaps the civilians there can provide some useful information."},
		{"LOCATION": "EXTERIOR: ONRAC . OUTSIDE CLINIC"},
		{"Soldier": "Have you found OXYALE?"},
		{"LOCATION": "EXTERIOR: ONRAC . BEHIND CLINIC"},
		{"Old Man": "Until 200 years ago the Mermaids lived in the Shrine. Then, in fire and smoke, it sank. The Mermaids?."},
		{"LOCATION": "EXTERIOR: ONRAC . PATHWAY"},
		{"Young Woman": "My legs are beautiful! It's so nice to have legs.", "_Comment": "hm? i'll let you figure it out"},
		{"ACTION": "MAN wMOHAWK: Underhill, the Caravan master, had something very strange."},
		{"ACTION": "PIRATE (BIKKE?): Avast ye landlubbers! Stay out of me way!"},
		{"LOCATION": "EXTERIOR: ONRAC . NEAR GRAVEYARD"},
		{"ACTION": "ANOTHER MAN wMOHAWK: Kope 'says' he saw a shining object fall."},
		{"LOCATION": "EXTERIOR: ONRAC . GRAVEYARD"},
		{"Man 16": "This town used to be prosperous 200 years ago.", "_Comment": "mourning"},
		{"LOCATION": "EXTERIOR: ONRAC . OUTSIDE BLACK MAGIC CENTER"},
		{"Witch": "You have legs!"},
		{"COMMENT": "(Note: lol)"},
		{"LOCATION": "EXTERIOR: ONRAC . BROOK'S SURROUNDINGS"},
		{"Underhill's Daughter": "My father runs the Caravan. He is having a close out sale near the oasis in the western desert."},
		{"LOCATION": "EXTERIOR: ONRAC . NEAR SOUTHERN EXIT"},
		{"Dragon": "I saw BAHAMUT, but to be honored as a true warrior I must return with proof of my courage."},
		{"Dragon": "Well, well.  I see you have been honored."},
		{"COMMENT": "Note: The former dialogue is spoken ONLY if you visit Onrac before changing. And if your wondering about the screen shot on the back of the FF box. nope, that text is NOT in the game. Go figure! I assume the translator pulled a last minute rephraseal. =P"},
		{"LOCATION": "EXTERIOR: ONRAC . EASTERN SIDE . SUBMARINE DOCK"},
		{"Kope": "My name is Kope. I saw it north, near the waterfall. Believe me! I think it was a robot."},
		{"Old Man": "Until 200 years ago, the Power of water brought us good fortune."},
		{"Woman 6": "I made a submarine to save the mermaids. But, to go deep enough it will require OXYALE."},
		{"LOCATION": "EXTERIOR: ONRAC . IN FRONT OF INN"},
		{"Woman 7": "Fables say that when the shrine sank, many treasures were lost. Also, they tell of a cryptic stone plate."},
		{"Dr. Unne's Brother": "My brother Dr. Unne has studied Lefeinish, the language of the SKY WARRIORS. If he had the SLAB, he could teach it."},
		{"COMMENT": "(FTR: population of Onrac is 20)"},
		{"LOCATION": "EXTERIOR: ABOVE THE CLOUDS"},
		{"ACTION": "The LIGHT WARRIORS having aquired the Fairy in the bottle from the Caravan in the desert now search for more clues to obtain the required OXYALE for the sub. The next town is GAIA. Maybe this town will thrust the LW further on their quest."},
		{"LOCATION": "EXTERIOR: GAIA . NEAR ENTRANCE"},
		{"Young Man": "This town is Gaia."},
		{"LOCATION": "EXTERIOR: GAIA . FIELD NEAR ENTRANCE"},
		{"Scholar": "Have you been to the city south of here? I just cannot understand a word spoken there. I have wondered what language."},
		{"LOCATION": "EXTERIOR: GAIA . ABOVE BLACK MAGIC CENTER"},
		{"Man 17": "Everyone thinks the tower in Yahnikurm Desert is a mirage. I wonder."},
		{"Scholar": "Legend says the SKY WARRIORS flew about, here and there, from a castle high in the sky."},
		{"LOCATION": "EXTERIOR: GAIA . NEAR WHITE MAGIC CENTER"},
		{"Young Woman": "Unbelievable! You are outsiders, right? How did you get this far north?"},
		{"LOCATION": "EXTERIOR: GAIA . NEAR INN"},
		{"Witch": "What's that broom up to? It's talking backwards! BROOM: ?rewoP taerg evah uoy oD"},
		{"LOCATION": "EXTERIOR: GAIA . FIELD SOUTH OF INN"},
		{"Man 18": "Legends say that the castle in the west is a place to test courage."},
		{"Elderly Lady": "The fairy at the spring was kidnapped."},
		{"LOCATION": "EXTERIOR: GAIA . SOUTHWEST CORNER OF TOWN"},
		{"Woman 8": "I saw a shining object flying towards the east."},
		{"LOCATION": "EXTERIOR: GAIA . OUTSIDE LV8 MAGIC CENTERS"},
		{"Man 19": "Only a fairy can draw OXYALE from the spring."},
		{"LOCATION": "EXTERIOR: GAIA . NEAR ITEM SHOP"},
		{"Scholar": "Let me see.  Yes, there was a professor that studied Lefeinish."},
		{"LOCATION": "EXTERIOR: GAIA . OUTSIDE CLINIC"},
		{"Pirate": "Hardy, har, you are too late! I BOTTLED the fairy and sold her to a caravan."},
		{"COMMENT": "(was Bikke behind this kidnapping? The world may never know...)"},
		{"LOCATION": "EXTERIOR: GAIA . WOODED AREA . FAIRY SPRING"},
		{"ACTION": "The LW slowly and cautiously release the fairy from the bottle near the edge of the spring. Magically, the fairy feels a calm come over her knowing that she is safe once more. She draws forth the much-needed OXYALE from the bottom of the spring with a magical spell in gratitude for being saved."},
		{"Fairy": "That pirate trapped me in the BOTTLE. I will draw OXYALE from the bottom of the spring for you. Thank you for saving me. Remember! OXYALE will give you air."},
		{"LOCATION": "EXTERIOR: ONRAC . SUBMARINE DOCK"},
		{"ACTION": "Back in Onrac, the LW pass the OXYALE to the submarine engineer. There they embark on a deep-sea adventure to the sunken Sea Shrine."},
		{"ACTION": "WOMAN (WHO BUILT THE SUB): WARRIORS, you have OXYALE. The mermaids wait, please help them!"},
		{"LOCATION": "INTERIOR: SEA SHRINE . FIFTH LEVEL . NORTHWEST ROOM"},
		{"Mermaid 1": "Unbelievable!! You can breathe underwater?! I'm impressed!"},
		{"LOCATION": "INTERIOR: SEA SHRINE . FIFTH LEVEL . NEXT ROOM"},
		{"Mermaid 2": "Are we going to become bubbles?"},
		{"LOCATION": "INTERIOR: SEA SHRINE . FIFTH LEVEL . NEXT ROOM"},
		{"Mermaid 3": "My friend Darryl went to the land, then never returned. I've often wondered what happened.  Maybe, she grew legs and walked away?"},
		{"LOCATION": "INTERIOR: SEA SHRINE . FIFTH LEVEL . NEXT ROOM"},
		{"Mermaid 4": "Please save the sea, and make the ORB shine again!"},
		{"LOCATION": "INTERIOR: SEA SHRINE . FIFTH LEVEL . NEXT ROOM"},
		{"Mermaid 5": "I suppose you are the legendary."},
		{"LOCATION": "INTERIOR: SEA SHRINE . FIFTH LEVEL . NEXT ROOM"},
		{"Mermaid 6": "If we cannot regain the Power of Water, we will become bubbles, then disappear."},
		{"LOCATION": "INTERIOR: SEA SHRINE . FIFTH LEVEL . NEXT ROOM"},
		{"Mermaid 7": "This is the Shrine's top floor. The FIEND of Water, KRAKEN lives on the bottom floor."},
		{"LOCATION": "INTERIOR: SEA SHRINE . FIFTH LEVEL . NEXT ROOM"},
		{"Mermaid 8": "As long as the FIEND of Water lives, we.  Oh, boo hoo."},
		{"LOCATION": "INTERIOR: SEA SHRINE . FIFTH LEVEL . NEXT ROOM"},
		{"Mermaid 9": "You have responded to me!!"},
		{"LOCATION": "INTERIOR: SEA SHRINE . FIFTH LEVEL . NEXT ROOM"},
		{"Mermaid 10": "To unlock the Mirage Tower the Lefeinish used a musical tone."},
		{"LOCATION": "INTERIOR: SEA SHRINE . WATER ORBS' ALTAR ROOM"},
		{"ACTION": "The FIEND's ball is shattered, evaporating all the water."},
		{"Kraken": "Ho, Ho, Ho.  How foolhardy to dare challenge me, KRAKEN the FIEND of the water."},
		{"ACTION": "<KRAKEN APPEARS>"},
		{"ACTION": "After a 'inky' battle, the water ORB shines brilliantly once again. YEAH!"},
		{"LOCATION": "INTERIOR: SEA SHRINE . FIFTH FLOOR . MERMAID ROOM"},
		{"Mermaid 11": "Now order has returned. The sea will be as it was before, beautiful."},
		{"LOCATION": "EXTERIOR: ONRAC . IN FRONT OF INN"},
		{"Dr. Unne's Brother": "Soar to my brother Unne with the SLAB!"},
		{"LOCATION": "EXTERIOR: MELMOND . NORTHEAST GRAVEYARD"},
		{"ACTION": "Back to Melmond to pay a visit to good ol' Dr. Unne. this time with the SLAB."},
		{"Dr. Unne": "A SLAB!! This SLAB will lead us to solve the riddle of the Lefeinish!! Now, listen to me."},
		{"Dr. Unne": "WARRIORS. Revive the Power of the ORBS!"},
		{"LOCATION": "EXTERIOR: MELMOND . OUTSIDE RUINED CLINIC"},
		{"Man 20": "OH! An Airship! The fables are true, it really exists!!"},
		{"LOCATION": "EXTERIOR: MELMOND . NEAR BLACK MAGIC CENTER"},
		{"Lady": "Well, well.  You have become fine warriors."},
		{"LOCATION": "EXTERIOR: GAIA . OUTSIDE MAGIC CENTERS"},
		{"Man 21": "What?? You can speak Lefeinish?"},
		{"COMMENT": "EXTERIOR: LEFEIN"},
		{"ACTION": "ALL TOWNSPEOPLE: Lu. pa. ? Lu. pa. ?"},
		{"COMMENT": "(Note: this is the phoneticverbal response you will receive every single time, sans the SLAB [Sea Shrine] & Dr. Unne's teachings [Melmond]. Sounds a little like those Willy Wonka elves, ne?? Sorry..)"},
		{"COMMENT": ""},
		{"LOCATION": "- The Final Fantasy Script - Part IV - FATE OF ALL"},
		{"LOCATION": "Chapter 9 - *The Sky's the Limit*"},
		{"LOCATION": "EXTERIOR: OVERWORLD . WATERFALL NORTHWEST OF ONRAC"},
		{"ACTION": "Utterly trampling KRAKEN, and reviving the Water ORB, not to mention saving the Mermaids to boot, the LIGHT WARRIORS succumb to the enchanting mysterious behind the waterfall..eluded to by the Onracian citizens. Here we go again! =)"},
		{"ACTION": "Penatrating the eluminant mists falling down from above, the LW discover a passagecavern that leads to somewhere. The search begins. Bats! (Remember ALL bats say the same thing.) Deeper and deeper, darker and darker... The LW finally reach a room with something shiny inside. What..a robot!?"},
		{"Robot": "Take this CUBE. With it, you can transfer to the FLOATING CASTLE."},
		{"ACTION": "Please."},
		{"LOCATION": "EXTERIOR: LEFEIN . NEAR ENTRANCE"},
		{"ACTION": "Merely possessing the CUBE is not enough to gain entrance to the Mirage Tower.. the LW decide to put their language skills to the test and try to speak with the people of Lefein."},
		{"COMMENT": "(Note: gender of townsfolf unknown - they appear androgenous, at least to me.)"},
		{"Person 1": "We are the Lefeinish. Only our bravest become SKY WARRIORS. Your AIRSHIP was theirs."},
		{"LOCATION": "EXTERIOR: LEFEIN . NARROW CAUSEWAY"},
		{"Guard 5": "At the time of destruction a legend was born.  In 400 years, WARRIORS with ORBS will appear to save our people . Are you?."},
		{"Guard 6": "Oh, the LIGHT WARRIORS!! The legend is true!"},
		{"LOCATION": "EXTERIOR: LEFEIN . WEST END . OUTSIDE RESIDENTIAL AREA"},
		{"Person 2": "Until 400 years ago we controlled the Power of the Wind. This enabled us to suspend the castle in the air."},
		{"Person 3": "400 years ago, we had an advanced civilization. Our interest was the universe!!"},
		{"LOCATION": "EXTERIOR: LEFEIN . WEST END . BRIDGED WALKWAY"},
		{"Person 4": "We have passed on the legends from generation to generation. But 400 years have caused our memories to fade."},
		{"Person 5": "The FLOATING CASTLE floats high in the sky, seemingly among the stars."},
		{"Person 6": "I wonder if the robots made by our ancestors are still moving?"},
		{"LOCATION": "EXTERIOR: LEFEIN . EAST END . NEAR RESIDENTIAL AREAS"},
		{"Person 7": "The FLOATING CASTLE.  Our ancestors lived there. The Mirage Tower is the entrance."},
		{"LOCATION": "EXTERIOR: LEFEIN . EAST END . BRIDGED WALKWAY"},
		{"Person 8": "The power of Wind was taken by TIAMAT."},
		{"Citizen 1": "We knew that a great power controlled the FIENDS. Our five bravest warriors left, never to return."},
		{"Citizen 2": "We fought with TIAMAT, but were unsuccessful. The FIEND now inhabits our FLOATING CASTLE."},
		{"Citizen 3": "With this CHIME you can enter the Mirage Tower."},
		{"ACTION": "<You get the CHIME!>"},
		{"ACTION": "The Mirage Tower was the gateway to our home in the sky."},
		{"LOCATION": "EXTERIOR: LEFEIN . NORTHEAST END . SECRET PATH"},
		{"Citizen 4": "Our last five warriors left to find the cause of the world's decay. We know they live, but, as bats."},
		{"LOCATION": "EXTERIOR: MIRAGE TOWER"},
		{"ACTION": "And so, the LIGHT WARRIORS merge closer with destiny as they approach the fourth and final FIEND. the FIEND of Wind! The Mirage Tower ominously suspends in the horizon, brooding in the burning desert, as if to call out to the LW ... they must heed it's call if they are to save the world from evil."},
		{"LOCATION": "INTERIOR: MIRAGE TOWER . FIRST FLOOR . BACK OF ROOM"},
		{"ACTION": "What looks like highly futuristic computer systems and gadgetry lines the walls of the robots' proximity. This civilization was indeed advanced."},
		{"Robot": "Are you the master?"},
		{"LOCATION": "INTERIOR: MIRAGE TOWER . SECOND FLOOR . TOP"},
		{"Robot": "One of us escaped with a CUBE. He floated far to the west."},
		{"LOCATION": "INTERIOR: MIRAGE TOWER . SECOND FLOOR . CENTER ROOM"},
		{"ACTION": "More and more advanced looking, the interior of the room is formed of almost completly computerized machines."},
		{"LOCATION": "INTERIOR: MIRAGE TOWER . THIRD FLOOR . INSIDE ROOM"},
		{"ACTION": "A lone robot stands before a large computerized device, frozen in time. The LW boldly step forward to where few have gone before..."},
		{"ACTION": "As if scooped up by a great force the LW are magically taken to a place high above the clouds ... above the planet."},
		{"LOCATION": "EXTERIOR: SPACE . SKY CASTLE"},
		{"ACTION": "Resting against a sea of stars, far above the blue-green surface of the planet. The Sky Castle is an ancient piece of the past, containing a tremendous evil."},
		{"LOCATION": "INTERIOR: SKY CASTLE . TRANSPORTER"},
		{"ACTION": "The LW are in awe in their surroundings. Where they are, is unlike nowhere else they have been or seen. Completely constructed of unknown materials and systems, the Sky Castle truly is advanced as the Lefeinish had hinted to. It exudes advanced technology and the LW are quite uncertain to what it all represents. Nevertheless, they seek out TIAMAT and try to illuminate the final ORB."},
		{"COMMENT": "Note: After aquiring the ADAMANT on floor two it is suggested that you return to the Dwarf's Cave to speak with Smith again. Why? He'll make you a little ol' sword called..Xcalber. It happens to be the most powerful sword in the game . AFTER Masmune, of course."},
		{"LOCATION": "INTERIOR: DWARF'S CAVE . SMITH'S ROOM"},
		{"Smith": "ADAMANT!! Now let me make the sword for you.  Here, the best work I've ever done. It is my gift. *******"},
		{"LOCATION": "INTERIOR: SKY CASTLE . THIRD FLOOR . WINDOW"},
		{"Robot": "You can look out over the world from this window."},
		{"ACTION": "Awestruck, the LIGHT WARRIORS peer out of the Sky Castle's window to look upon the world they live on. The power residing here is monumental!"},
		{"ACTION": "From this window one can see the entire world. The Four Forces are flowing together, into the center of the Four Altars. Into the Temple of FIENDS."},
		{"LOCATION": "INTERIOR: SKY CASTLE . THIRD FLOOR . SOUTH OF ENTRANCE . SMALL ROOM"},
		{"ACTION": "A computerized system of sorts glows and beeps oddly. The leader of the party touches one of the glowing indicators and."},
		{"Computer": "TIAMAT is the FIEND of the WIND.  A larger room to the south even proves to be a control room of sorts. Chairs indicate that operators are still needed and that it's not fully automated. Explaining the existance of the scattered robots??"},
		{"LOCATION": "INTERIOR: SKY CASTLE . FIFTH FLOOR . WIND ORB'S ALTAR ROOM"},
		{"ACTION": "Much more 'evolved' than the three before. this FIEND is clearly the strongest and toughest of the bunch. TIAMAT means business and HER quarters emitt an haunting state even in her abscence."},
		{"ACTION": "The LW exam the FIEND's ORB closely. sparks jolt throughout the room everywhere and suddenly the beast empowered with the element of Wind..comes to life."},
		{"ACTION": "Lightning, erupts from the FIEND's ball. TIAMAT: So, you have come this far. I, TIAMAT the FIEND of the Wind will now put an end to your adventure!!"},
		{"ACTION": "<TIAMAT shows herself!>"},
		{"ACTION": "Soon, even TIAMAT falls to the hands of the mighty LIGHT WARRIORS! YOU DID IT! YOU'VE REVIVED ALL FOUR ORBS!!! ^^"},
		{"LOCATION": "Chapter10 - *Ancient Future*"},
		{"ACTION": "(Note: As always, once you complete a significant taskobstacle. talk to the townsfolk again. More often than not, the occasional NPC will muse something new for you.)"},
		{"ACTION": "Lets start back in Coneria shall we?..."},
		{"LOCATION": "EXTERIOR: CONERIA . BEHIND MAGIC CENTERS"},
		{"Old Man": "As legend foretold, once again the ORBS shine!! Quickly, to fulfill the legend, take them to the Temple north of here, and stand in the center."},
		{"LOCATION": "EXTERIOR: CRESCENT LAKE . SECLUDED GROVE (CIRCLE OF SAGES)"},
		{"Sage": "The Temple of FIENDS is in the center of the Four Altars. The time has come to destroy the source of evil."},
		{"Sage": "With the four ORBS shining again the Time Gate can be broken. The true enemy is 2000 years in the past."},
		{"Sage": "The world was suddenly thrown into disorder. You must restore it."},
		{"Sage": "Time is repeating. In order to break the Time-Loop you must eliminate the enemy who controls from 2000 years in the past."},
		{"Sage": "Someone travelled 2000 years to the past. The four FIENDS were sent forward in time. Those FIENDS threaten to destroy the world today."},
		{"Sage": "I see now, someone who travelled back 2000 years is the cause of the world's destruction. After 2000 years he will travel back again.  Then again.  Then again."},
		{"Sage": "Time will repeat itself every 2000 years. Break the time-loop!"},
		{"LOCATION": "EXTERIOR: TEMPLE OF FIENDS"},
		{"ACTION": "The LIGHT WARRIORS moment of truth! What will be the Final enemy?? Let's go!"},
		{"LOCATION": "INTERIOR: TEMPLE OF FIENDS . INNER SANCTUMGARLAND'S ROOM"},
		{"ACTION": "The LIGHT WARRIORS take out the four ORBS and magically they hover and glow in the air. Then, supernatuarally, via a great force, they become one and engulf the Black(evil) ORB."},
		{"ACTION": "The four ORBS now cover the black ORB. To take a step forward is to go back 2000 years in time."},
		{"COMMENT": "(Oops! Forget what I said earlier. All bats don't always say the same thing. The bats in the Temple of Fiends are the only exception though. due to the fact that in the past they were once human and were transformed by Garland.)"},
		{"Bat": "You must travel back in time 2000 years. Now, with the ORBS shining, stand in the Time Gate."},
		{"Bat": "Help! The FIEND's curse turned us into bats. With the ORBS shining anew, once again we can speak."},
		{"Bat": "We are the five lost SKY WARRIORS. 400 years ago we battled against the cause of the world's destruction."},
		{"Bat": "The Four FIENDS power is rooted 2000 years ago. The real enemy is in that time."},
		{"Bat": "When the 4 ORBS cover the black ORB in the center of the palace, the Time Gate can open."},
		{"LOCATION": "INTERIOR: TEMPLE OF FIENDS . CENTER ROOM . TIME GATE The LIGHT WARRIORS enter...."},
		{"LOCATION": "INTERIOR: TEMPLE OF FIENDS"},
		{"ACTION": "The LIGHT WARRIORS stand. unknown is their future..or their past. What ever they do here though will decide the very fate of the world in both time periods. This is where hero's are made."},
		{"LOCATION": "INTERIOR: TEMPLE OF FIENDS . THIRD FLOOR . CENTER ROOM"},
		{"ACTION": "The LIGHT WARRIORS discover a plate, like that of which was encountered in the Earth Cave in the future."},
		{"ACTION": "There is a stone plate on the floor. You sense something. Evil?."},
		{"ACTION": "The LW use the LUTE. The tune plays, revealing a stairway."},
		{"LOCATION": "INTERIOR: TEMPLE OF FIENDS . FIRST BASEMENT FLOOR"},
		{"ACTION": "LICH is met again, and he now has the ability to utilize NUKE. ouch! Watch out - sometimes he can surprise ya!"},
		{"LOCATION": "INTERIOR: TEMPLE OF FIENDS . SECOND BASEMENT FLOOR"},
		{"ACTION": "KARY is still quite the ill-tempered lady. although the LW bust 'er up with ease."},
		{"LOCATION": "INTERIOR: TEMPLE OF FIENDS . THIRD BASEMENT FLOOR"},
		{"ACTION": "KRAKEN is still his arrogant self. Show 'em what yer made of and wup his slimy arse. =) Ultros would even be embarassed to say he's in the same species as ol' KRAKEN."},
		{"LOCATION": "INTERIOR: TEMPLE OF FIENDS . FOURTH BASEMENT FLOOR"},
		{"ACTION": "TIAMAT, eh? She could still prove an intresting challenge even this late in the game. Be on yer toes. She's sneaky that way."},
		{"COMMENT": "(Note: Don't forget to pick up Masmune on this floor.) xa1 . . o O( Hey, stupo! It's a (O~) script..not a FAQ!) C( )> oo"},
		{"LOCATION": "INTERIOR: TEMPLE OF FIENDS . FIFTH BASEMENT LEVEL"},
		{"ACTION": "The Final Battle awaits the LW here. Deep in the Temple stirs an ignoble evil schemeing to plague the world with torment. it must be put to an end..once and for all. Now the LIGHT WARRIORS face the TRUE enemy. and the fate of the entire world hangs in the balance."},
		{"LOCATION": "INTERIOR: TEMPLE OF FIENDS . FIFTH BASEMENT LEVEL . CENTRAL ROOM"},
		{"ACTION": "The LIGHT WARRIORS enter to view a man standing in a dimly lit room. Behind him seems to be a palimpsest surrounded by the 4 elements of the world: Earth, Water, Wind, and Fire."},
		{"Garland": "Remember me, Garland? Your puny lot thought it had defeated me. But, the four FIENDS sent me back 2000 years into the past."},
		{"ACTION": "From here I sent the FOUR FIENDS to the future. The FIENDS will send me back to here, and the Time-Loop will go on."},
		{"ACTION": "After 2000 years, I will be forgotten, and the Time-Loop will close. I will live forever, and you shall meet doom!!"},
		{"ACTION": "<GARLAND transforms, by an order of magnitude, into CHAOS after absorbing all the elemental powers of the world, battle ensues>"},
		{"ACTION": "The final battle wCHAOS took everything the LW had but they fought valiantly and destroyed the evil at it's source. Forever will Garland's wickedness be silenced. The LIGHT WARRIORS triumph and save the world!!! ;D Peace shall reign forevermore."},
		{"ACTION": "EPILOGUE"},
		{"ACTION": "The Time-Loop is now broken! The 2000 year long battle is over. Peace prevails."},
		{"ACTION": "Control of the four elements, the Earth, the Wind, the Fire, and the Water, again belongs to the earth."},
		{"ACTION": "Garland's hatred burned for 2000 years. That hatred led the Four Powers to this world."},
		{"ACTION": "CHAOS was created from those Four. Evil dominated the world and covered it in darkness."},
		{"ACTION": "But, it is over now, wrong has been set right!!"},
		{"ACTION": "The LIGHT WARRIORS are returning. As they travel in time, the world returns to normal."},
		{"ACTION": "Sara and Jane wait for them. Of course, Garland does too."},
		{"ACTION": "But, when did it ever happen?."},
		{"ACTION": "Everything went mad in a day. The reason lies in the 2000 year Time-Loop."},
		{"ACTION": "The Four chose to become one force, and fight against the four evil forces that set darkness upon the world."},
		{"ACTION": "When the Four return, it will be to their past. All signs of the battle with the Forces will be erased."},
		{"ACTION": "But the legend will live on. Passed down by the Dwarves, the Elves, and the Dragons."},
		{"ACTION": "Passed on by peoples unsure where the story came from."},
		{"ACTION": "The LIGHT WARRIORS return from their journey back in time 2000 years."},
		{"ACTION": "The memories stored deep in their hearts will protect the world."},
		{"ACTION": "Never forget the good and true. Never turn the Four Powers to the dark side."},
		{"ACTION": "And truth will always live in the hearts of the people."},
		{"ACTION": "The Warrior who broke the 2000 year Time-Loop is truly a LIGHT WARRIOR. That warrior was YOU!"},
		{"ACTION": "May the ORBS always shine!!."},
		{"ACTION": "The End"}]
}